[{"model": "api.stockanalysis", "pk": 1, "fields": {"author": "financialhorse@gmail.com", "name": "Financial Horse", "title": "Is Apple Stock A Buy Ahead Of June-Quarter Earnings Report?", "ticker": "AAPL", "text": "Apple (AAPL) saw its shares surge during Wall Street's flight to quality names after the recent coronavirus stock market correction. Analysts hope the consumer electronics giant's financials will spring back quickly when the global economy recovers from the Covid-19 pandemic. With Apple stock on the upswing, many investors are wondering if AAPL stock is a buy right now.\n\nApple has been an American success story several times over. First, it ignited the personal computer revolution in the 1970s with the Apple II. Then it reinvented the PC in the 1980s with the Macintosh.\n\nCo-founder Steve Jobs returned to run Apple in 1997 and oversaw a winning streak of innovations that included the iMac, iPod, iTunes, iPhone, iPad and the App Store.\n\nThe biggest driver of Apple's modern success is the iPhone. The game-changing smartphone, which debuted in 2007, sparked years of massive growth and created a loyal base of customers willing to buy Apple products and services.\n\nBut iPhone sales have slowed as users hold on to their handsets for longer periods between upgrades. However, the company could be on the brink of a major upgrade cycle with its first 5G iPhones, due out this fall.\n\nApple Stock News: 5G iPhone Delay?\nApple usually releases its latest iPhones in September, but market uncertainties related to the coronavirus pandemic could delay the launch.\n\nOn June 4, wireless chipmaker Broadcom (AVGO) signaled that Apple is pushing back the production ramp for its next-generation iPhones by about a month. The news supported earlier media reports that Apple is postponing the iPhone 12 series launch because of manufacturing interruptions in Asia and weakened global consumer demand due to the coronavirus pandemic.\n\nHowever, recent reports from Apple's supply chain indicate that the company is back on for a September launch. Analysts expect the iPhone 12 lineup to include both 4G and 5G handsets.\n\nOn April 15, Apple introduced a lower-cost smartphone aimed at budget-conscious consumers and emerging markets. The second-generation iPhone SE starts at $399.\n\nApple Opportunities For Growth\nWith iPhone growth slowing, investors are wondering what the next big growth driver will be for Apple stock.\n\nLately, two businesses have given Apple's sales and profits a boost: services and wearables.\n\nIn the March quarter, Apple's services revenue rose nearly 17% to $13.35 billion. Services include App Store, AppleCare, iCloud, Apple Pay, Apple Music, Apple TV+, Apple Arcade and other offerings.\n\nOn April 21, Apple launched a major international expansion of its services offerings. It brought the App Store, Apple Arcade, Apple Podcasts and iCloud to 20 more countries and Apple Music to 52 additional countries.\n\nMeanwhile, Apple's Wearables, Home and Accessories unit saw sales jump 22.5% to $6.28 billion in the March quarter. This unit includes wearables like the Apple Watch, AirPods wireless earbuds and Beats headphones. It also contains the Apple HomePod wireless speaker and other miscellaneous gadgets.\n\nApple Earnings: Beat And No Guidance\nOn April 30, the Cupertino, Calif.-based company delivered better-than-expected March-quarter results but withheld guidance.\n\nApple earned $2.55 a share on sales of $58.31 billion in its fiscal second quarter ended March 28. Analysts were looking for earnings of $2.26 a share on sales of $54.54 billion. On a year-over-year basis, Apple earnings rose 4% while sales inched 1% higher.\n\nIn the March quarter, iPhone sales fell 6.7% to $28.96 billion. Mac computer sales dropped 2.9% to $5.35 billion. And iPad tablet sales slid 10.3% to $4.37 billion. Growth in services and wearables helped offset those declines.\n\nApple did not issue guidance for the June quarter, citing market uncertainties related to the coronavirus pandemic. It plans to release its fiscal third-quarter results on July 30.\n\nWall Street predicts Apple earnings of $2 a share on sales of $51.5 billion. In the year-earlier quarter, Apple earnings were $2.18 a share on sales of $53.81 billion.\n\nAAPL Stock News: WWDC Announcements\nOn June 22, Apple kicked off its annual Worldwide Developers Conference. The conference switched from an in-person gathering to an online event this year because of the Covid-19 pandemic.\n\nIn the opening keynote presentation, Apple executives discussed the company's move to in-house processors for Mac computers from Intel (INTC) processors. They also showed off the latest software for the iPhone, iPad, Mac, Apple Watch and Apple TV set-top box.\n\nApple's iOS 14 smartphone operating system will include more customizable home screens, improved Siri assistance, enhanced privacy features, and mini-apps called App Clips. The release, due out this fall, also includes improvements to Maps, Messages and other applications.\n\nExclusive Apple Stock Ratings\nSince the bounce back from the lows of the coronavirus stock market crash, Apple stock has been outperforming the broader market.\n\nAAPL stock has an IBD Relative Strength Rating of 91 out of 99. That puts it in the top 9% of stocks over the past 12 months. In a bullish sign, the stock's relative strength line is in record-high territory. The RS line, the blue line in the charts here, measures a stock's price performance vs. the S&P 500.\n\nApple stock has an IBD Composite Rating of 93 out of 99, according to the IBD Stock Checkup tool.  IBD's Composite Rating combines five separate proprietary ratings of fundamental and technical performance into one easy-to-use rating. The best growth stocks have a Composite Rating of 90 or better.\n\nApple was the first company to reach a market value of over $1 trillion. Since it hit that milestone in August 2018, Microsoft (MSFT), Amazon.com (AMZN) and Google-parent Alphabet (GOOGL) have joined it in the trillion-dollar club.\n\nApple stock was the first to gain a market value of over $1.5 trillion in early June. Amazon and Microsoft have since followed.\n\nAAPL Stock Technical Analysis\nOn April 29, Apple stock broke out of a second-stage cup-with-handle base with a buy point of 288.35, according to IBD MarketSmith charts. It is now extended from that buy point.\n\nThe Dow Jones tech giant recently passed a secondary buy point of 319.79 from a cup-with-handle base visible on a weekly MarketSmith chart. The new buy point is an alternative entry, according to IBD Leaderboard analysis. The breakout here gave investors the opportunity to add to an existing position.\n\nOn July 6, Apple stock notched an all-time high of 375.77 during intraday trading.\n\nIs Apple Stock A Buy Right Now?\nApple stock is not a buy right now. It is trading beyond the 5% chase zone of its last proper breakout. Also, it is trading above the 20%-to-25% profit-taking zone of April 29 breakout, according to IBD trading guidelines.\n\nAAPL stock will need to form a new base in the right market conditions before setting a new potential buy point.\n\nKeep an eye on the overall stock market. Stocks have regained ground lately, but if the trend changes, don't try to fight the general stock market direction.\n\nTo find the best stocks to buy and watch, check out IBD's Stock Lists page. More stock ideas can be found on IBD's Leaderboard and MarketSmith platforms.", "created_date": "2020-07-13T06:29:29.739Z", "upvotes": 547}}, {"model": "api.stockanalysis", "pk": 2, "fields": {"author": "financialhorse@gmail.com", "name": "Financial Horse", "title": "Is Microsoft Stock A Buy As Lockdowns Boost Cloud Demand? Here's What Its Stock Chart Shows", "ticker": "MSFT", "text": "Is Microsoft (MSFT) stock a buy, as it stages a brisk recovery following the sell-off triggered by the coronavirus pandemic?\n\nMicrosoft shares have climbed nearly 30% since touching a March 23 low, slightly outpacing the S&P 500's 28.8% gain. Even at the low end of the dive, Microsoft stock held its status in the $1 trillion club — making it briefly the only company in the world with a market capitalization of more than $1 trillion.\n\nApple (AAPL) and Amazon (AMZN) dipped below the trillion-dollar mark during their pullbacks. Both have since rebounded and returned the club to three members.\n\nAll three companies have seen mixed impact — some good, some bad — from the economic effects of the global coronavirus pandemic. Microsoft stock's rebound has been less aggressive than either Apple (up 34.4%), or Amazon (with a 39.2% gain). Amazon stock broke out of a cup base on Tuesday.\n\nBut while Apple works on a possible base pattern, Microsoft has shaped what IBD MarketSmith chart analysis defines as a double-bottom base. It climbed well above its 10-week moving average on Tuesday, moving to within easy striking distance of the buy point. As a double bottom, however, the base is lopsided. A better interpretation is that Microsoft is forming a cup-type base. IBD Leaderboard has identified a 190.80 buy point.\n\nThe megacap cloud-computing stock was first a pre-internet pioneer of the personal computing era, locking down a vast share of the operating systems and software used worldwide. The company now owns LinkedIn, Skype and GitHub, in addition to its legacy Windows operating system and the Xbox gaming and Office 365 businesses. And it has confirmed its status as a leader in cloud-computing services, artificial intelligence and productivity tools, competing toe-to-toe with Amazon.com and Alphabet's (GOOGL) Google.\n\nCloud Computing: JEDI, 5G Infrastructure Deals\nMicrosoft is repeatedly landing infrastructure-scale deals as it plays catch up to Amazon in the global cloud services market. In February, Synergy Research Group put Amazon's share of what it estimates is a $100 billion market at 33%, vs. an 18% share for Microsoft and an 8% share for Google Cloud.\n\nIn October, Microsoft beat out Amazon to land a 10-year U.S. Defense Department cloud-computing contract estimated at $10 billion, according to Bloomberg. Amazon, which was initially awarded what is known as the JEDI, or Joint Enterprise Defense Infrastructure, contract, is contesting the deal, saying that President Donald Trump had biased the Pentagon's bidding process.\n\nIn early February, White House economic advisor Larry Kudlow named the company as a key player in a project to develop a 5G networking protocol that would cut China Huawei out of the implementation of the new broadband networks in the U.S.\n\nMicrosoft reported in mid-March its Teams collaboration software had spiked to 44 million daily active users. That was up from 20 million in November, adding 12 million new users in the week prior to the announcement. Teams provides videoconferencing, team-chat applications, competing with Zoom Video (ZM), Slack Technologies (WORK) and others.\n\nMicrosoft's Pandemic Boost\nMicrosoft ranks among the companies seeing benefits from the massive global shift to at-home workforces, caused by the coronavirus pandemic. A video statement from Microsoft said the company sees the shift as an \"inflection point,\" pointing to a sharp expansion in the global use of such tools.\n\nOn April 9, Microsoft reported Teams traffic had hit a new daily record of 2.7 billion meeting minutes in a single day, a 200% increase from 900 million minutes on March 16.\n\nZoom and Slack offer some functions that Teams does not. Microsoft's Teams suite has document editing and some other capabilities not available through either Zoom or Slack. Teams is available at no charge for business subscribers of Microsoft's Office 365 cloud productivity suite. Also in March, Microsoft announced a number of Teams upgrades, including background noise suppression for conferences and a low-bandwidth chat function that enables conversations over slow internet connections.\n\nFiscal Q2: Another Big Beat\nIn Microsoft's fiscal second-quarter, ended in December, the company once again blew past analyst consensus expectations on both its revenue and earnings lines. Earnings growth accelerated to 37%, rising to $1.51 per share. Revenue growth held steady at 14%, hitting $36.9 billion. Analysts had projected earnings of $1.32 and sales of $35.68 billion, according to Zacks Investment Research.\n\nMicrosoft's $7.5 billion acquisition of GitHub in October 2018 aimed to help drive additional business to its Azure cloud-computing services. A January report this year from RBC Capital projected a 55% year-over-year gain in Azure demand during the quarter. Actual growth for Azure came in at 62%. Growth in the business unit averaged 68% over the prior four quarters\n\nGrowth in Intelligent Cloud unit revenue held steady at 27%, rising to $11.9 billion. Sales of commercial cloud software and services rose 39% to $12.5 billion last quarter.\n\nSales for Microsoft's Productivity and Business Processes segment jumped 17% to $11.8 billion. That segment includes the company's Office, Dynamics and LinkedIn businesses.\n\nMicrosoft reported a gross margin of 66.5% for the quarter, beating the consensus estimate of 64.7%. Moreover, its operating margin of 37.6% exceeded analyst estimates for 34.3%. The company's More Personal Computing segment was under close scrutiny, after constraints in chip supplies pressured the segment's Windows revenue. Segment sales rose 2% during Q2, to $13.2 billion.\n\nAt least 18 analysts raised their price targets on Microsoft stock after the earnings report.\n\nA $136 Billion War Chest\nAlso during Q2, the heavyweight reported it had reduced its long-term debt to $63.36 billion, down slightly vs. Q1 and compared to $69.7 billion at the end of 2018. That held its debt-to-equity ratio around 65%. The number is high relative to smaller software names like Adobe (ADBE), but well below that of others, such as Oracle (ORCL).\n\nHowever, the debt might for now at least be a moot metric. That's because Microsoft's fiscal second quarter report showed total cash, equivalents and short-term investments of $134.25 billion, down slightly from $136.64 billion in the prior quarter. Yes, that's billion — not a typo. So, if worse comes to worst, fundamentally speaking, the outfit is able to cover its bills for a couple of months.\n\nMicrosoft is scheduled to report its fiscal Q3 results after the market closes on April 29.\n\nMicrosoft Stock Technical Analysis\nMicrosoft stock sailed 53% higher in 2019. It climbed another 21% this year, before the coronavirus stock market crash. Shares dived about 30% below that high before starting to recover. On Friday, Microsoft was showing a year-to-date gain of 12%.\n\nMicrosoft's Relative Strength Rating from IBD today is a rock-solid 95. Its relative strength line has angled up to new highs, also a bullish signal.\n\nMicrosoft's Accumulation/Distribution Rating is a C+. That suggests that smart money investors are generally holding or adding to positions, not exiting the stock. The stock's up/down volume ratio of 0.8 is a weak point. You would like to see that number rise above 1.0, which would suggest some upward price pressure on the stock.\n\nInvestors can check a stock's Relative Strength Rating or any other key IBD metric at IBD Stock Checkup.\n\nIs Microsoft A Buy?\nSo, is Microsoft stock a buy? The answer depends on the investor.\n\nFor the average investor, the answer is: Not yet. Microsoft's four-week rally has driven the stock back above both its 40-week and 10-week moving averages, and above the midpoint in what IBD's Leaderboard reads as a nine-week cup base. Shares on Friday were a bit less than 8% below that base's 190.80 buy point.\n\nBut the base can also be construed as a double-bottom base, providing a buy point at 175.10. This is how IBD MarketSmith analysis reads the chart. For more aggressive investors, Microsoft stock is currently a buy — in a buy range above that entry. The buy range runs through 183.85.\n\nAnd for those with an even great tolerance for risk, Microsoft is also a buy. Leaderboard points out an even more aggressive entry at 170.10. Microsoft stock rose past that entry in weak trade on Tuesday. The chase zone for that buy point runs to 178.61.\n\nMicrosoft capitalized on breakouts in February, June and October last year. So its track record is fairly solid.", "created_date": "2020-07-13T06:31:37.468Z", "upvotes": 439}}, {"model": "api.stockanalysis", "pk": 3, "fields": {"author": "financialhorse@gmail.com", "name": "Financial Horse", "title": "Is Netflix Stock A Buy Right Now? Here's What NFLX Earnings, Charts Show", "ticker": "NFLX", "text": "Netflix stock spent a lot of time without making progress over the last two years. But last week, it finally punctured the highs hit in June 2018. Despite growing competition, Netflix stock has jumped more than 50% since September. With people staying home due the coronavirus shutdown, streaming content is an obvious beneficiary. But, should you buy Netflix stock now?\n\nNetflix Stock Fundamental Analysis: Weakness Starts A Base\nNetflix (NFLX) has an incredible history of earnings growth. Its average five-year earnings-per-share growth rate is an impressive 83%, according to MarketSmith calculations. Included in that figure is a rather unimpressive showing from the last quarter of 2018 through the middle of 2019. The final quarter of 2018 saw earnings drop 27% from the same quarter the previous year. While earnings grew 19% in the first quarter of 2019, the second-quarter earnings dropped 29%. It led to a flattening of the trailing twelve months earnings per share number and little progress in the stock.\n\nCompounding the problem was a big subscriber miss in July 2019. When Netflix reported second-quarter earnings results after the close on July 17, the decline in earnings was expected. What wasn't expected was a big miss in the subscriber target. The forecast was for Netflix to see new streaming subscriber growth of 5 million and it came in at 2.7 million. That included a loss of domestic subscribers attributed to price increases. The stock gapped down for a 10% loss and started a steep decline in its 2019 base.\n\nTurnaround Starts Before Covid-19 Pandemic\nStarting in the third quarter of 2019, earnings were on a turnaround. Earnings accelerated from the 29% loss of the second quarter in 2019 to 65% growth in the third quarter and 333% growth in the last quarter of 2019. Part of the big boost in the fourth quarter was due to an adjustment of over-accrued taxes, a benefit of the 2017 tax cuts. The end result was a 12-month trailing earnings per share at new highs\n\nAlso in the fourth quarter, Netflix still fell short of its domestic 600,000 target for new subscribers, but less dramatically. Just a couple hundred thousand shy. International subscribers, meanwhile, came in more than a million better than expected at 8.3 million subscribers added for the quarter.\n\nThe stronger fourth quarter set Netflix stock up for a potential breakout for the first time in nearly a year.\n\nNetflix Earnings And The Safer-At-Home Effect\nAs shelter-in-place orders went into place around the world, Netflix stock in particular seemed to be getting a lot of attention. People looked to content providers to fill their extra time at home. Binge watching is certainly easier when you don't have an early commute ahead of you.\n\nThe first quarter was seeing expectations roughly met in the first two months. In March, the coronavirus changed everything. Subscription growth blew away the 8 million estimated by analysts as growth jumped by 15.8 million.\n\nInternational subscriptions have been a large source of revenue growth for the company. In their latest letter to Netflix stock shareholders, management pointed out that over half their revenue is not denominated in the U.S. dollar. The strength in the dollar during the coronavirus economic impact offset a lot of the revenue gains seen internationally. That put the revenue growth of 28% in line with expectations.\n\nAs for earnings, they came in lower than estimates at $1.57 per share vs. an expected $1.65 per share. Still it was an increase of 107% over the prior year. That's deceleration from the 333% growth of the prior quarter but triple digit growth can often make that forgivable.\n\nNetflix Cash Burn An Issue?\nIn the past decade, Netflix transitioned from just a content distributor to a content creator as well. It ventured into original content with the release of \"House of Cards\" in 2013 and introduced a new argument for membership. Subscribing is the only way to access the original programming that now makes up 40% of the content offering according to Raymond James analyst, Justin Patterson.\n\nBut between the content purchased and created, Netflix has a cash burn issue. According to company financial statements, 2018 was more than $3 billion in the hole for non-GAAP free cash flow. That deficit grew to $3.3 billion in 2019 in what was expected to be the peak of negative free cash flow. Their goal of slowly bringing that number to positive originally had a 2020 projection of negative $2.5 billion. But with production halted due to the spread of the coronavirus, some of those cash outlays are uncertain. The company has donated to relief funds to support those affected by production halts, and paid directly those on Netflix projects as a bridge until government stimulus kicked in. But the most recent projections call for just negative $1 billion in free cash flow for 2020 with some of the original outlays pushed to future years. The expectation is for a continued trend toward positive free cash flow but with some added lumpiness. Netflix original content gives them more control and better profit margins, their key to keeping the trend going.\n\nThere is still the question: Will it pay off? It's certainly helping Netflix reach new levels of quality.\n\nCan Quality Programming Spur Subscriber Quantity?\nNetflix came in second for nominations and wins in the 2019 Emmy race, just behind HBO. For the Oscars in 2020, Netflix took the title of most nominations at 24. Though they only won two, it still speaks to an impressive achievement given their original film initiative is under five years old. But can it convert the awards and accolades into more subscribers?\n\nWith the investment in high-quality programming available only to subscribers, Netflix is trying to increase not just its viewership but the time spent using its service. That's where it sees its growth opportunities. In its letter to shareholders from the first quarter 2019, the company emphasized that even in its most mature market, the U.S., TV streaming hours on Netflix only make up 10% of total TV usage. Cable and satellite TV providers still dominate the market. But as viewers shift away from a linear-programming model, Netflix is a contender for a place to land. But the competition is heating up.\n\nWalt Disney (DIS) joined the streaming game as a serious contender with its Disney+ launch in November. Wall Street cheered the announcement, pointing to Disney's huge content library and attractive price point of $6.99. Marvel Comics superheroes and \"Star Wars\" epics, along with other Disney-owned content, will no longer drive viewers to Netflix but rather to the competition.\n\nNetflix says it welcomes the competition. With Disney offering more family-oriented programming, there is certainly room for both. Especially when the combined price tag is only $20 per month. But in the short time since launch, Disney has gained a lot of ground on the domestic subscription numbers of Netflix. Granted, they also have to contend with the rising costs associated with the new service.\n\nFor as much buzz as the new Star Wars series \"The Mandalorian\" got for Disney+, Netflix pointed out their original fantasy series \"The Witcher\" didn't disappoint. In a chart shared by Netflix, they pointed to Google Trends analysis showing higher interest for \"The Witcher\" over \"The Mandalorian.\" The comparison puts Disney+ at a disadvantage, though, as it isn't available in as many regions as Netflix. Still, it does demonstrate the head start Netflix has in reaching a global audience. Sometimes being early makes it hard for others to catch up. Look no further than the many remote controls that offer a Netflix button prominently.\n\nAttacks From Multiple Fronts\nAnd Disney stock isn't the only big-name competitor. Apple (AAPL) is also getting in on the action with its own streaming service, Apple TV+. Apple will also produce original programming, which it just announced with a big splash from celebrities in front of and behind the camera. Their price? Just $4.99 a month as of Nov. 1 last year. It's also free for a year with the purchase of a new iPhone or Apple Watch. However, with less original content available, Apple isn't seeing nearly the same splash as Disney.\n\nStreaming service launches are also coming from networks like Comcast (CMCSA)- owned NBCUniversal and CBS (CBS). Advertising revenue is a key component of the lower price point in their business models. In a letter to Netflix stock investors after the second-quarter earnings report, executives dispelled rumors that Netflix would employ a similar strategy. That decision might be a good one right now in a coronavirus pandemic. Many companies severely reduced their advertising spend. That could give the subscription-based revenue model of Netflix an edge.\n\nIs There Still Room For Growth?\n\nEven with the crowd, many areas, globally and across devices, have a lot of room to grow. With regards to mobile offerings, Greg Peters, chief product officer for Netflix, put it this way: \"Over 97.5% of people around the world are using other different entertainment services, other ways to enjoy their time on their mobile phone,\" he said in a Q&A during a previous earnings call. Making headway there can pay off.\n\nAs Disney has demonstrated for years, viewing popularity can also translate into merchandising opportunities. Netflix took notice and hired Christie Fleischer from Disney as its global head of consumer products. She was the head of merchandise and product development for Disney parks, experiences and consumer products.\n\nAs an example of how this plays out, the Netflix original \"Stranger Things\" touched a nerve for lovers of science fiction and nostalgia with its '80s backdrop. Merchandising opportunities have followed the ardent fan base. In just one example, at the Electronic Entertainment Expo (E3), Nintendo (NTDOY) showcased its \"Stranger Things 3: The Game.\" The game launched along with the third season of the series on July 4 last year.\n\nOpportunities can also come from stores like Hot Topic, which enters into licensing agreements to make T-shirts and other merchandise. Netflix isn't looking to get into the video game or clothing business, but sees the merchandise as a way to cater to avid fan bases and potentially increase them.\n\nNetflix Stock Joins Leaderboard And SwingTrader On Breakout\nIt's been nearly two years since Netflix stock was in new high territory. But the action ahead of the latest earnings report pushed it above 400 for the first time since July 2018. The long base of 2019 tacked on what could be considered a handle with a 393.62 buy point. Netflix cleared it on April 13 and it was added to both Leaderboard and  SwingTrader on that day.\n\nOne could argue that wasn't much time before the earnings report of April 21 but each product had a different strategy on that front. SwingTrader focuses on short-term trades. The expectation was to be out of the stock before the earnings call. SwingTrader took an early entry at 386.02 with half profits taken at 10% and a final exit on April 16 at 445.95 when the stock was up 15.5% from the initial entry and within a percent of its recent high. Better than expected but still done according to plan.\n\nLeaderboard, also took an early entry at 388.92. The goal was to let a profit cushion build up that would allow us to hold through earnings. The plan there came to fruition as well.\n\nNetflix Stock Technical Analysis Of Bases\nIt's still worth revisiting the path Netflix stock took to get here.\n\nIn the bear market of the final quarter in 2018, Netflix stock saw a 40% drop in its base, larger than we like to see. That base failed after announcements by competitors and subscriber misses punished the stock. This more recent base was better, but far from perfect. The weekly chart helps put the correction in perspective.\n\nThe depth of the most recent base is tighter at 34%, which suggests more resilience. It has more symmetry to its movement on both the left and right sides of the cup base. But that is still marred by the big drop in July due to the subscriber miss. Even with its drops, the Netflix stock price still retained a good portion of its 18-month rise that started in 2017. But is it an early- or late-stage base?\n\nAn old Wall Street adage says, \"They either wear you out or scare you out.\" For Netflix stock, it's a little of both.\n\nOne could argue Netflix stock's long hibernation resets the base count. If you haven't been worn out after being down on your stock for two years, you're an investor with stamina. And back-to-back bases that steep most likely scared out the remaining weaker holders. That makes the recent base an early-stage base with the potential for a fresh move. But there's still a glaring flaw in the 2019 base.\n\nRelative Strength Weakens In 2019\nIn the first half of 2019, Netflix stock staged a 36% gain, double that of the S&P 500. The bulk of the gain came from a powerful jump off its lows in the first few weeks of the year. It's the last time its relative strength was impressive. Take that away, and progress in Netflix stock is not so great. As a result, the Relative Strength Rating fell as low as 12 over the summer as Netflix stock went negative for the year. It's made nearly a 50% move off its bottom but the relative strength line, which compares the stock vs. the S&P 500, is still well off its highs.\n\nThere are cases of stocks with weaker relative strength still working out for big gains. Usually this occurs when a stock is basing during a strong move in the rest of the market. Even Apple stock had weak relative strength when it broke out in 2004. Most of the market skyrocketed in 2003 while Apple formed a base, leading to the lower relative strength. Similar to how Netflix stock based in what ended up being a strong 2019.\n\nBut the cases that go on to become true market leaders are certainly rare exceptions. IBD research has found that the average Relative Strength Rating of the best stock market winners hovers around 87 out of a best 99. The 2004 base in Apple stock was much more orderly than what Netflix stock is showing now. Apple also had the benefit of new products and services, iTunes and iPods, to act as an earnings catalyst. Can Netflix stock say the same?\n\nIs Netflix Stock A Buy Right Now?\nWhen all is said and done, Netflix stock turned a corner in 2020. The handle that got tacked on to the 2019 base is really a base in its own right. And the relative strength line is soaring. The S&P 500 fell 35% from its February highs to its March lows. Netflix stock only fell 26% during that time. That quickly sent the relative strength line to new highs and improved the outlook. The S&P 500 had a follow-through day on April 2 and the Nasdaq composite followed suit April 6. That puts the market in a favorable position. While true that not all follow-through days work, Netflix is one of the better looking patterns in the current market environment but is currently extended from its April 13 breakout. It's best to wait for another consolidation before making another purchase.\n\nThe earnings reaction and pause in the market knocked Netflix stock down 6% off its high, but it needs more time to truly give another buying opportunity. The technical and fundamental action are currently painting a better picture than the stock has seen for nearly two years. As such it should remain on your watchlist.", "created_date": "2020-07-13T06:35:23.954Z", "upvotes": 361}}, {"model": "api.stockanalysis", "pk": 4, "fields": {"author": "drwealth@gmail.com", "name": "Dr Wealth", "title": "Is Apple Stock a buy?", "ticker": "AAPL", "text": "Apple's (NASDAQ:AAPL) latest earnings report was upbeat about the future, despite softness in demand for iPhones and wearables. Apple reached a new record for active users across its iDevices and continues to see new users for premium services, such as Apple TV+, Arcade, and News+.\n\nThe stock has returned market-crushing returns for investors over the last decade, but the near term will be challenging. Growth in its largest sales category, the iPhone, has been slowing. This trend will worsen in the near term, especially as consumer spending takes a hit with higher unemployment as a result of COVID-19. \n\nI own shares of Apple and believe the business will continue to grow over time. But is this the right time to buy the stock? To answer this question, we'll review a few reasons to wait, along with a few reasons to take the plunge.\n\nReasons not to buy\nA weak outlook for iPhone sales is one reason to pass on Apple stock for now, especially since the stock has already rebounded off recent lows and sits at a high valuation relative to underlying growth. \n\nDuring the last conference call, management didn't offer guidance but did state that sales of iPhone and wearables (e.g. Apple Watch) will worsen through June. The iPhone comprised half of Apple's total revenue in its most recent quarter. \n\nBullish investors point to the growth of the services business, but it currently makes up only 23% of Apple's revenue, so it's not enough to completely offset potential softness in iPhone sales. \n\nSome investors may be looking ahead to the next upgrade cycle, when Apple is expected to announce the new 5G-enabled iPhone. But there is always the possibility that the new iPhone could be delayed due to the coronavirus pandemic, or that the upgrade cycle may not be as strong as expected.\n\nHowever, Apple disclosed on its last earnings call that its supply chains were back up and running, so it seems the new iPhone is on schedule for launch in the fall. \n\nThe faster connection speeds of a 5G iPhone could cause a huge upgrade cycle over the next few years. But assuming the new iPhone does release as expected this fall, it's unclear what the demand will look like, especially since more than 20 million Americans just lost their jobs in April, the largest decline ever recorded in a single month. \n\nFor what it's worth, the consensus analyst estimate currently expects Apple to report 1% growth in revenue and low-single-digit growth in earnings in fiscal 2020 (which ends in September). That is very low growth for a stock that is trading at 25 times forward earnings estimates.\n\nReasons to buy\nApple stock may have limited upside in the near term, given its slowing growth and high valuation. But investors who are looking to start a new position in one of the top brands in the world could do so for a few reasons.\n\nApple is a solid business, with a mountain of cash to invest in new products and services to drive growth over the long term. It is continuing to invest in new products and has pledged to invest $350 billion in the U.S. economy over the next five years. I'm certainly not selling my shares, even if Apple reports a decrease in revenue and earnings for the full fiscal year. I'm more interested in where Apple will be in 10 years.\n\nNo one knows exactly what the demand curve will be for a 5G iPhone, but over the next decade, 5G connection speeds will bring several benefits. \n\nOne area to watch is mobile gaming -- the fastest-growing market in the video game industry. Faster connection speeds will make these apps run at much higher performance overall, especially when connecting multiple players in a competitive game at the same time. This will make iPhones and iPads much more formidable gaming platforms. \n\nApple is continuing to look for acquisitions to expand its capabilities. It just acquired NextVR, a provider of sports and other content for virtual reality products. The deal will only fuel recent rumors that Apple may release a new device with virtual reality or augmented reality technology, such as smart glasses, in the next few years. \n\nApple is a safe stock to buy, but it's no bargain\nApple will remain a good investment for the long haul. Its installed base of active devices continues to grow, although slowly. In January, Apple reported an installed base of more than 1.5 billion active devices, up 100 million over the preceding 12 months. The growing installed base should lead to a more valuable business over time, which should translate to a rising stock price.\n\nBut investors thinking of buying this FAANG stock should keep in mind the near-term risk of weak demand for the iPhone, coupled with the stock's relatively high forward P/E ratio of 25. That combination is not a recipe for a rising stock price from the current high.\n\nNew investors who love Apple and want skin in the game could start small and gradually add shares over time, which is a perfectly reasonable way to invest in businesses you like. This is the way I invest when I love a company, but not the stock's valuation.", "created_date": "2020-07-13T06:38:15.623Z", "upvotes": 487}}, {"model": "api.stockanalysis", "pk": 5, "fields": {"author": "drwealth@gmail.com", "name": "Dr Wealth", "title": "Microsoft Is a Low-Risk Stock With Upside", "ticker": "MSFT", "text": "Microsoft (NASDAQ:MSFT) has shown great strength throughout the novel coronavirus pandemic. Growth in the company’s cloud businesses remains in motion. If there ever was a time for cloud computing, now’s likely the moment. This is a strong catalyst, as Microsoft stock has made new highs in recent weeks.\n\nBut, whether markets pull back or bounce higher, what’s next? Even as reported coronavirus cases are on the rise again, shares could remain resilient if markets continue to head lower.\n\nValuation is rich, but may still be reasonable, considering the company’s underlying strength. Even if a “work-from-home” economy extends through the summer, this could mean continued tailwinds for Microsoft’s remote-friendly applications.\n\nThese include Skype, Office 365, and now, Microsoft Teams. Speaking of Teams, the collaboration platform is growing rapidly, helping to bolster long-term growth.\n\nLet’s dive in, and see why Microsoft is still a buy in today’s market.\n\nMicrosoft Stock, Coronavirus and Teams\nIn early June, hard-hit stocks briefly went parabolic, as investors jumped back into high-risk sectors. This included airline, casino, and retail names. The types of bricks-and-mortar businesses threatened by coronavirus shutdowns. But, as Wall Street loses confidence in a V-shaped recovery, these recent “high-flyers” could fall back to prior prices.\n\nYet, with tech names like Microsoft, uncertainty may be limited.  Back in April, the company met expectations regarding earnings, citing minimal impact from the pandemic. Revenue from its Azure cloud business grew 59% from the prior year’s quarter. Office 365 revenues climbed 25%. Revenue overall grew 15%, and earnings per share jumped 23% year-over-year.\n\nBut growth across these platforms isn’t the only thing to get excited about. Microsoft Teams, a collaboration platform, continues to beat expectations. As our own Luke Lango wrote in May, the platform saw its Daily Active User base surge 70% quarter-over-quarter, to 75 million users.\n\nWith Teams, Microsoft is giving rival collaboration SaaS names a run for their money. Goldman Sachs’s Heather Bellini recently said the platform’s success could affect Slack’s (NYSE:WORK) long-term growth. And based on what the analyst team at Baird said in May, Zoom Video (NASDAQ:ZM) may be under competitive threat from Teams as well.\n\nSo, what does this success mean going forward? The potential for strong results again this quarter. And while forward multiples may look rich, there could be good reason why a premium valuation is here to stay.\n\nDespite Valuation, MSFT Could Still Head Higher\nBefore the selloff, Microsoft was one of the hottest stocks out there. Driven by growth in the company’s Azure cloud business, shares soared from around $120 per share in April 2019, to as high as $190.70 per share in February 2020. Quite impressive, considering what’s needed to move the needle for a trillion-dollar company.\n\nWhen shares took a dip in March, they became more reasonably priced. But even though shares trade higher now than they did pre-pandemic, the stock could continue to trend higher. Even  though the tech giant continues to trade at a premium valuation.\n\nWhat do I mean? Analyst consensus calls for earnings to grow around 9% between Fiscal 2020 (ending June 2020) and Fiscal 2021. In short, you can’t call Microsoft “cheap,” considering its near-term growth prospects.\n\nThe stock’s forward price-to-earnings ratio stands at 34.5. Compared to FAANG names like Apple (NASDAQ:AAPL), that looks pricey. Apple trades for around 28.5 times forward earnings.\n\nHowever, this rich multiple has done little to scare off the analyst community. Deutsche Bank’s Taylor McGinnis recently raised her price target, from $180 per share to $215 per share. Her rationale? The analyst cites Azure’s continued strong prospects. Wedbush’s Dan Ives agrees, saying the stock could head as high as $275 per share.\n\nCOMPARE BROKERS\nYet, there’s a chance shares could head in the other direction, due to valuation. As our own Dana Blankenhorn recently pointed out, the rich valuation of cloud stocks can’t last forever. Keep this in mind as shares trade near all-time highs.\n\nDon’t Expect Big Moves, But Still a Solid Buy\nI wouldn’t buy into Microsoft’s stock thinking shares are going to post massive gains in the next year. But, in terms of finding a low-risk opportunity with upside, the company’s shares may be the place to be.\n\nSo far, coronavirus has had minimal impact on Microsoft’s bottom line. With recent events serving as a tailwind, growth remains in motion. Add in the potential for Teams to gain critical mass in the next year, and the trillion-dollar tech giant continues to have runway.\n\nSure, valuation is not dirt cheap, and could easily contract. But in terms of quality and low-risk, it may be worth the price. Whether markets sell-off or climb higher from here, consider adding Microsoft to your stock portfolio.", "created_date": "2020-07-13T06:41:04.330Z", "upvotes": 361}}, {"model": "api.stockanalysis", "pk": 6, "fields": {"author": "drwealth@gmail.com", "name": "Dr Wealth", "title": "Should You Buy Netflix Stock Right Now?", "ticker": "NFLX", "text": "As a clear winner in the stay-at-home trends prompted by coronavirus-related lockdowns, it's not surprising that Netflix (NASDAQ:NFLX) stock has been an outperformer in 2020. The stock is up 34% year to date, crushing the S&P 500's 1% decline over this same timeframe.\n\nSo far, the streaming-TV company has delivered on investors' hopes that sheltering at home would boost viewership and subscriptions. Net new subscriber additions in the company's first quarter came in at 15.8 million, obliterating management's guidance for 7 million new members during the period. But some have wondered how much of this momentum could carry into Netflix's second quarter as the economy reopens.\n\nOne analyst thinks Netflix's momentum has continued -- and he's reiterating a bullish $535 12-month price target on the growth stock to reflect his optimism for the company.\n\nWhy this analyst is so bullish\nJ.P. Morgan analyst Doug Anmuth said in a note to investors on Wednesday that Netflix's daily active user and download trends remain at elevated levels lately. Citing data from Apptopia, Anmuth said Netflix's daily active user growth has remained at a year-over-year growth rate of about 20% in recent weeks. Further, Netflix app download trends are still significantly better than pre-pandemic levels but are well below the peak download trend for the app during the coronavirus lockdowns. \n\nIn addition, Anmuth pointed out that Netflix has seen strong Google search trends for recent releases of original productions.\n\nA strong quarter is likely\nThe trends Anmuth says he is seeing in daily active users and downloads aren't too surprising. While many U.S. states have begun opening their economies, some businesses remain closed or at least at limited operations. Further, it will likely take some time for consumers to feel comfortable venturing out to large gatherings and crowded places like they did before the coronavirus. All of this means that many people are likely still spending more time at home than they were before COVID-19 hit. \n\nAt the time of Netflix's first-quarter report in April, management acknowledged that there's significant uncertainty about how things will play out in Q2 and beyond. The company guided for 7.5 million net member additions (much higher than the 2.7 million net member additions the company saw in the second quarter of 2019) but management said that \"Given the uncertainty on home confinement timing, this is mostly guesswork.\" Actual net member additions during the period could be \"well below or well above that, depending on many factors including when people can go back to their social lives in various countries and how much people take a break from television after the lockdown.\"\n\nBased on the data Anmuth pointed out, Netflix may have underestimated how much lockdowns would continue to benefit the company in Q2.\n\nIs Netflix stock a buy?\nOf course, investors interested in buying Netflix stock should have far more in mind than a single quarter. But it's not like the company wasn't already growing rapidly before COVID-10. In Netflix's fourth quarter, global streaming paid members were up 20% year over year and revenue jumped about 31% year over year. There's nothing indicating Netflix won't continue growing its business at rapid rates in 2020 and beyond, particularly overseas where Netflix penetration is lower.\n\nAny investor who considers following Anmuth's advice should keep in mind that shares are quite expensive today. The stock trades at 88 times earnings. But given the company's strong momentum and a boost in subscriptions recently because of the pandemic, Netflix will likely easily grow into this valuation over the long haul.", "created_date": "2020-07-13T06:42:46.209Z", "upvotes": 386}}, {"model": "api.stockanalysis", "pk": 7, "fields": {"author": "seedly@gmail.com", "name": "Seedly", "title": "Is Apple stock a good buy during Covid-19 uncertainty?", "ticker": "AAPL", "text": "Apple (AAPL) is a brand most valued by its consumers as well as shareholders; in fact, it has been an investor favourite for a long time. Its iPhone success helped the business to reach the $1tr (£800bn, €920bn) valuation back in 2018. However, the company appeared to not be immune to the Covid-19 pandemic. While the short-term outlook is bleak for the iPhone maker, could the long-term opportunity from 5G outweigh the looming troubles?\n\nApple stock was trading near its all-time high of $327.85 in February before the deadly virus put the global economy into tailspin. The share price fell 32 per cent in the March sell-off as the uncertainty around the pandemic triggered panic selling. While the uncertainty prevails, the panic has subsided, and the stock recovered rising 34 per cent from its March low. \n\nAAPL is now trading near $360, raising the question among investors of whether it is the right time to invest in Apple stock now. To answer it, in this article, we take a look at Apple's business in the Covid-19 environment, its ability to withstand these tough times and its future growth opportunities.\n\nIf history is any guide, is Apple stock a good buy?\nConsumers like Apple because of its premium products, such as the iPhone, MacBook, iPad and Apple Watch. However, these products make the company a cyclical stock and also prone to an economic downturn. \n\nIn the 2008 financial crisis, Apple stock witnessed two major sell-offs. The first one pulled the stock down 40 per cent between January 1 and February 18; the second dragged the stock down 53 per cent between August 18 and January 12, 2009. \n\nHowever, the share price grew 27 fold over the next 10 years as the economy recovered from the crisis, and its iPhone devices made it the world's third-largest smartphone vendor.\n\nApple was the first American company to reach the $1tr market valuation in August 2018. Warren Buffett called it the \"best business in the world\", with the firm topping Berkshire Hathaway's portfolio with an asset value of $75.4bn.\n\nTo protect itself from cyclicality, Apple started expanding its services segment that generates stable and recurring revenue. The company's transition to services is finally paying off.\n\nApple's business in the Covid-19 environment \nIs Apple stock a good buy during the times of today’s turbulent market environment? Taking a look at its recently published financial quarterly report, the company’s revenue rose 0.5 per cent year-on-year (YoY) to $58.3bn as strength in the services segment more than offset weakness in the products segment. The company now earns 77 per cent of its revenue from products and 23 per cent from services.\n\nApple's iPhone suffered the biggest casualty, as both demand and supply were disrupted. The company assembles almost all its smartphones in China, the origin of the virus. Moreover, Apple had to close its retail stores amid the global lockdown, which negatively impacted its product sales. In the recent quarter, iPhone, Mac and iPad revenues fell 7 per cent, 3 per cent, and 10 per cent respectively, on a YoY basis. Apple CFO Luca Maestri expects iPhone demand to fall lower in the next quarter.\n\nThe coronavirus pandemic has changed the way people are using Apple products. Even though the firm’s device sales fell, the company is seeing a record uptick in its services, which include App Store, Apple News, Apple TV, Apple Music, Video, cloud services, and App Store search ad business. In the recent quarter, the services sector revenue rose 16 per cent YoY to an all-time high of $13.35bn.\n\nAs noted by Morgan Stanley analyst Katy Huberty, April was the strongest month for Apple's App Store. Citing preliminary data from Sensor Tower, she estimates that App Store downloads rose 40 per cent YoY, boosting its net revenue 31 per cent YoY in April.\n\nChallenges and opportunities for Apple in 2020\nThe year 2020 brings both challenges and opportunities for the business. If we look at the absolute revenue figures, Apple's Services revenue rose $1.9bn, while its product revenue fell $1.6bn in fiscal Q2. The prolonged Covid-19 scenario will only boost its services segment, which earns a gross margin of 65.4 per cent, more than double the product segment gross margin of 30.3 per cent.\n\nThe global lockdown is driving demand for iPad and Mac as people shift to online education and work-from-home regimes. Apple has leveraged this opportunity by launching its new iPad Pro, Magic Keyboard, MacBook Air, and the new iPhone SE. \n\nRaymond James analyst Chris Caso and Daiwa analyst Louis Miscioscia are optimistic about Mac and iPad sales in the June quarter. They raised their price target on Apple to $305 and $320, respectively.\n\nThe smartphone market is saturating, but the next-generation 5G technology could revive demand in the coming years. Apple is scheduled to launch its first 5G iPhones later this year. The new iPhones could drive sales in the December quarter. \n\nIt is largely expected that once life returns to normal and the economy recovers, Apple's product business will revive. The pandemic will make people more health conscious and drive demand for the Apple Watch that helps monitor a patient's heart rate, while keeping the data secure.\n\nHowever, even if Apple's business adjusts to the Covid-19 crisis, the growing tensions between the US and China still present a major challenge. China is Apple's production hub, and the US is its biggest market. When the US-China trade war ignited in the fourth quarter of 2018, Apple stock shed 33 per cent. Renewed trade tensions could deal another blow to the share price.\n\nSo, is Apple a good investment in 2020? \nNow, this brings us to the question of why you should buy Apple stock.\n\nHistory shows that Apple has successfully recovered from economic downturns and generated positive returns to those who bought its shares at the dip. In the past 12 years, Apple's stock has fallen five times only to grow more. \n\nThe company managed to overcome every crisis because of its strong balance sheet and cash flows. In fiscal Q2 2020, Apple generated $13.3bn in cash and had $192.8bn in cash reserves. The firm even increased dividends by 6 per cent and announced a $50bn share repurchase programme, indicating that the business has enough cash to withstand a downturn and still give returns to shareholders. \n\nThe verdict: Apple stock – buy, sell or hold?\nApple stock gives returns through capital appreciation and dividend. If you had invested $1,000 in the stock in March, you would have earned $241 in capital appreciation and $3.38 in the total dividend. \n\nAs the company’s share price has already recovered from the March sell-off, the most common question is: is now a good time to buy Apple stock?\n\nAt $300, Apple is now trading at a PE (price-to-earnings) ratio of 22.6x, which is close to its 52-week high of 26.93x. In terms of valuation, the stock looks expensive in the current market scenario plagued with a looming economic and political crises. There is uncertainty around the duration and magnitude of the pandemic, its financial and economic impact, the US elections, and growing tensions between the US and China. Even Apple's management cannot provide guidance amid these unstable times. \n\nShould I buy Apple shares? It is advisable not to buy a cyclical stock like Apple at its current valuation. If there is another sell-off and Apple stock falls, that is a good buy point.", "created_date": "2020-07-13T06:46:27.127Z", "upvotes": 210}}, {"model": "api.stockanalysis", "pk": 8, "fields": {"author": "seedly@gmail.com", "name": "Seedly", "title": "Is Microsoft (MSFT) a Smart Long-term Buy?", "ticker": "MSFT", "text": "If you are looking for the best ideas for your portfolio you may want to consider some of Amana Mutual Funds top stock picks. Amana Mutual Funds, an investment management firm, is bullish on Microsoft Corp (NASDAQ:MSFT) stock. In its Q4 2019 investor letter – you can download a copy here – the firm discussed its investment thesis on Microsoft Corp (NASDAQ:MSFT) stock. Microsoft Corp (NASDAQ:MSFT) is a technology company based in Washington. The stock is up 7.1% since the Amana Mutual Funds pitch in February 2020, which suggests the investment firm was right in its decision.\n\nOn February 15, 2020, Amana Mutual Funds had released its Q4 2019 Investor Letter. Amana Mutual Funds said that Microsoft Corp (NASDAQ:MSFT) was a top contributor to its performance in 2019. Microsoft Corp (NASDAQ:MSFT) stock positively impacted the Amana Income Fund’s return by 2.34% in 2019.\n\nFor the quarter ended December 31st, 2019, Amana Income Fund recorded a return of 9.58%, compared to 9.07% of the S&P 500 Index. This brings its 2019 full-year return to 25.28%, compared to 31.49% of the S&P 500 Index.\n\nLet’s take a look at comments made by Amana Mutual Funds about Microsoft Corp (NASDAQ:MSFT) in the letter.\n\n\"Microsoft has done an excellent job building its Azure cloud services business, while we believe a strong period of semiconductor demand will arrive in the new decade supporting Microchip and Taiwan Semiconductor. Whether the rally starts in 2020 or 2021 remains to be seen but recent signs have been positive.\"\n\nIn Q1 2020, the number of bullish hedge fund positions on Microsoft Corp (NASDAQ:MSFT) stock increased by about 24% from the previous quarter (see the chart here), so a number of other hedge fund managers seem to agree with Microsoft's growth potential. Our calculations showed that Microsoft Corp (NASDAQ:MSFT) is ranked #2 among the 30 most popular stocks among hedge funds.\n\nThe top 10 stocks among hedge funds returned 185% since the end of 2014 and outperformed the S&P 500 Index ETFs by more than 109 percentage points. We know it sounds unbelievable. You have been dismissing our articles about top hedge fund stocks mostly because you were fed biased information by other media outlets about hedge funds' poor performance. You could have doubled the size of your nest egg by investing in the top hedge fund stocks instead of dumb S&P 500 ETFs. Below you can watch our video about the top 5 hedge fund stocks right now. All of these stocks had positive returns in 2020.\n\nAt Insider Monkey we leave no stone unturned when looking for the next great investment idea. For example, 2020’s unprecedented market conditions provide us with the highest number of trading opportunities in a decade. So we are checking out stocks recommended/scorned by legendary Bill Miller. We interview hedge fund managers and ask them about their best ideas. If you want to find out the best healthcare stock to buy right now, you can watch our latest hedge fund manager interview here. We read hedge fund investor letters and listen to stock pitches at hedge fund conferences. Our best call in 2020 was shorting the market when the S&P 500 was trading at 3150 after realizing the coronavirus pandemic’s significance before most investors. You can subscribe to our free enewsletter below to receive our stories in your inbox:", "created_date": "2020-07-13T06:48:44.873Z", "upvotes": 237}}, {"model": "api.stockanalysis", "pk": 9, "fields": {"author": "seedly@gmail.com", "name": "Seedly", "title": "Netflix Earnings: Will Subscribers Soar Higher Again?", "ticker": "NFLX", "text": "Believe it or not, earnings season for Q2 is just around the corner. Streaming-TV company Netflix (NASDAQ:NFLX), which is always one of the first major growth stocks to report earnings each quarter, has set a date for its second-quarter earnings release that is less than two weeks out -- on July 16.\n\nThe company set the bar high for its second-quarter results when it announced its first-quarter performance earlier this year. Not only did Netflix add a record 15.8 million new subscribers during the period, but it also guided for 7.5 million subscriber additions in Q2 -- a figure that's far ahead of the 2.7 million new members the company added in the second quarter of 2019. Many investors are likely hoping the momentum Netflix saw from consumers sheltering at home toward the end of Q1 will carry over into Q2.\n\nAs we head into Netflix's second-quarter update, here's some important background information to keep investors informed.\n\nSubscriber growth is key\nNetflix's membership growth saw a huge uptick in Q1 due to home confinement. The 15.8 million subscribers the company added were more than double the 7 million new members management had forecast it would add during the period. Outperformance during the quarter, of course, was primarily due to lockdown orders implemented in many countries beginning in March.\n\nIn Q2, investors will look for more strong member growth as lockdowns were still in effect when Q2 started. Though management guided for 7.5 million new subscriber additions during the period, many investors are likely hoping actual net new member additions will be higher since many economies around the world haven't fully reopened.\n\nOf course, investors should also check on the company's guidance for subscriber growth in Q3. To keep up its accelerated subscriber growth, Netflix will need to guide for more than 6.8 million new members during the period -- the amount of subscribers it added in the third quarter of 2019.\n\nExpectations are high\nBased on Netflix stock's recent performance, investors are likely expecting a stellar quarter from the streaming-TV juggernaut. Shares are up nearly 50% year to date, crushing the S&P 500's 3% decline over this same time frame. This gives the company a price-to-sales-ratio of 10 and a price-to-earnings ratio of 97, highlighting the substantial growth investors have priced into the stock.\n\nNetflix is among the stay-at-home stocks that look exceptionally well-positioned to benefit from the unique environment created by the coronavirus pandemic. It's not surprising, therefore, to see investors bid up shares, as they hope the company can capitalize on a timely opportunity to gain new subscribers.\n\nNetflix reports its second-quarter results on Thursday, July 16 after market close.", "created_date": "2020-07-13T06:49:54.416Z", "upvotes": 237}}, {"model": "api.stockanalysis", "pk": 10, "fields": {"author": "thefifthperson@gmail.com", "name": "The Fifth Person", "title": "Google Stock: Is It A Buy As Economies Reopen And Anti-Trust Battle Looms?", "ticker": "GOOGL", "text": "Google stock conjures images of the Energizer Bunny TV commercials. GOOGL stock just keeps going.\n\nGoogle stock has climbed despite reports that the Department of Justice could file an antitrust lawsuit this summer. And, GOOGL stock has clawed back from the coronavirus-driven market doldrums in March.\n\nGoogle-parent Alphabet (GOOGL) reported mixed first-quarter earnings as digital advertising growth slowed. Heading into the June quarter earnings report, some analysts are upbeat as economies reopen.\n\n\"We see Google search revenue as highly correlated with overall GDP growth,\" said Bank of America analyst Justin Post in a recent report. Post raised his price target on Google stock to 1,610, also citing YouTube's growth and the cloud computing business.\n\nDue to its huge cash holdings, GOOGL stock has shrugged off three fines totaling $9.3 billion levied by the European Union on antitrust grounds. The Justice Department, though, could force Google to restructure if it wins in court. A legal battle could drag on for years, though.\n\nIn the March quarter, Google bought $8.5 billion of its own stock, topping the December quarter's $6.1 billion.\n\nWith Amazon.com (AMZN) gaining ground in digital advertising, Google recently made a big change in how it handles e-commerce listings.\n\nGoogle Stock: More Transparency On Cloud, YouTube\nMost investors still know it as Google, even though the internet search giant reorganized as holding company Alphabet in 2015. The restructuring move separated Google's core internet advertising business from so-called moonshots, such as autonomous vehicles.\n\nUnder new Alphabet Chief Executive Sundar Pichai, the transparency issue bugging Google stock could be going away. The technology giant disclosed YouTube advertising\n\nGoogle stock's strength in artificial intelligence, though, spans digital advertising, the Google Cloud Platform, YouTube and consumer hardware products as well as a line item it calls \"Other Bets,\" like Waymo self-driving cars and the Verily Life Sciences unit. GOOGL stock is just one artificial intelligence stock to watch.\n\nPichai Compensation Package\nGoogle still dominates in digital advertising, along with Facebook (FB). While Google has expanded into cloud computing and consumer hardware, digital advertising is still the lion's share of revenue.\n\nOn Dec. 3 Google said co-founder Larry Page will step down as Alphabet's chief executive, with Pichai, the CEO of the Google unit, replacing him. Google co-founder Sergey Brin stepped down as Alphabet's president.\n\nGoogle stock climbed on the shake-up. The street viewed Pichai's new pay package positively because it increases ties to shareholder returns.\n\nGoogle's profit margins remain an issue amid high investments in data centers for cloud computing, artificial intelligence, YouTube and consumer products.\n\nThe government's anti-trust probe may focus on Google's advertising business, some analysts say. A regulatory crackdown is a worry for Google as well as other internet companies that gather consumer data.\n\nGOOGL Stock: Fundamental Analysis\nWall Street analysts had lowered estimates heading into the Google Q1 earnings report because of the Covid-19 emergency.\n\nGoogle GAAP earnings were $9.87, missing estimates of $10.73. Google gross revenue rose 13% to $41.159 billion, topping estimates of $40.98 billion.\n\nAlphabet said it expects the pace of buybacks to stay high. Meanwhile, Google said it will slow hiring and moderate capital spending amid the coronavirus emergency.\n\nGoogle Properties revenue rose 11.6% to $28.54 billion, below recently lowered estimates of $29.07 billion. That includes ad and services revenue from internet search, Gmail, Google Play and YouTube.\n\nYouTube revenue rose 33% to $4.038 billion. Cloud computing revenue rose 52% to $2.78 billion.\n\n\"We see Google likely benefiting as the pandemic could be a tailwind for ad budgets shifting online, momentum in Google Cloud supporting consolidated growth, and Other Bets providing optionality for patient investors,\" Canaccord Genuity analyst Maria Ripps said in her recent note to clients. \"This, coupled with prudent expense management, a strong balance sheet, and share repurchases, gives us comfort around Alphabet's ability to successfully withstand this near-term disruption.\"\n\nKey Financial Metrics For Google Stock\nIn early 2018, Google changed accounting methods. It switched to reporting GAAP earnings, or generally accepted accounting principles. GAAP earnings include stock-based compensation.\n\nOne closely watched financial metric relates to Google's traffic acquisition costs, or TAC. That's what it pays to partner websites to carry ads. TAC has been going up as Google relies more on partner sites and third-party apps to gain traffic and generate mobile advertising revenue.\n\nA key question for investors is how much should self-driving-car project Waymo and Other Bets figure into valuation.\n\nIn early 2018, some analysts projected Waymo's long-term valuation in a range of anywhere from $75 billion to $125 billion. Expectations for autonomous vehicles, though, have been lowered recently.\n\nWaymo in early March raised $2.25 billion in funding from outside investors including private equity firm Silver Lake, the Canada Pension Plan Investment Board and Abu Dhabi's Mubadala investment arm. Venture capital firm Andreessen Horowitz, AutoNation and Magna International also took part.\n\nWhile Google did not disclose Waymo's valuation in the funding round, reports said it was only $30 billion. Google may license its autonomous vehicle technology.\n\nGoogle Stock: More Cloud Acquisitions Coming?\nAnother question is the performance of Google's hardware business. It's taking on Apple (AAPL) in smartphones and Amazon in smart-home appliances.\n\nGoogle's new cloud gaming service, Stadia, launched on Nov. 19.\n\nGoogle on Nov. 1 agreed to buy smartwatch maker Fitbit for $2.1 billion. The purchase could help Google make a push into the health and fitness market, analysts say. The deal has not closed.\n\nGoogle's cloud computing business, meanwhile, lags rivals Amazon and Microsoft. Google brought in Thomas Kurian, a former Oracle (ORCL) executive, to improve performance in the corporate market.\n\nGoogle in June purchased data analytics firm Looker for $2.6 billion in cash. Santa Cruz, Calif.-based Looker's analytics platform uses business intelligence and data visualization tools. More acquisitions to boost Google's cloud business could be coming, analysts say.\n\nSalesforce.com (CRM) looms as one target, but its market valuation poses a hurdle.\n\nAlphabet is one of the closely-watched FANG stocks. The other FANG stocks include Facebook, Amazon and Netflix (NFLX).\n\nGoogle's Relative Strength Rating is 80 out of a possible 99, according to IBD Stock Checkup. The best stocks tend to have an RS rating of 80 or better.\n\nTypically the strongest stocks' relative strength lines are either confirming or leading a stock's price into new high ground. The RS line is in blue on all IBD stock charts and at MarketSmith.\n\nGOOGL Stock: Is It A Buy Now?\nGoogle stock owns an Accumulation/Distribution Rating of B-minus. It analyzes price and volume changes in a stock over the past 13 weeks of trading.\n\nThe rating, on an A+ to E scale, measures institutional buying and selling in a stock. A+ signifies heavy institutional buying; E means heavy selling. Think of the C grade as neutral.\n\nGOOGL stock on Jan. 16 closed at 1,450.16, reaching a $1 trillion market cap. It hit an all-time high of 1,530.74 in intraday trading on Feb. 19.\n\nAmid the coronavirus-driven market sell-off, Google stock fell to 1,054.13 on March 23, down 34% from its high. However, Google stock rallied and forged a new cup-with-handle entry point of 1,415.63.\n\nAs of June 17, Google stock traded in a buy zone about 3% above that entry point.\n\nSome argue that Google stock is long past the glory days when it gained nearly 800% in little more than three years after its initial public offering. In recent years, Google stock typically keeps pace with the S&P 500, punctuated by brief periods of out-performance.", "created_date": "2020-07-13T06:54:48.062Z", "upvotes": 256}}, {"model": "api.stockanalysis", "pk": 11, "fields": {"author": "thefifthperson@gmail.com", "name": "The Fifth Person", "title": "Is Starbucks Stock A Buy Right Now? Here's What Earnings, Stock Chart Show", "ticker": "SBUX", "text": "Seattle-based Starbucks (SBUX) emerged as a coffeehouse giant in the 1990s with a meteoric rise, evolving from a local concept into a global brand. After the recent coronavirus stock market crash, the company's value has declined to about $96 billion with annual sales in excess of $26 billion.\n\nIn a new stock market rally, is Starbucks stock one of the top stocks to watch in the current stock market?\n\nStarbucks Earnings Dive On Coronavirus\nIn the most recent quarter — reported on April 28 — earnings dove 47% year over year to 32 cents per share, while sales fell 5% to $5.99 billion. Earnings and sales beat expectations, but same-store sales came in worse than expected. In response, Starbucks stock fell 2.3%.\n\nIn the current quarter, earnings are expected to dive 121% to a loss of 16 cents per share. Sales are expected to fall 35% to $4.4 billion vs. the year-ago period.\n\nAccording to the IBD Stock Checkup, Starbucks has a middling 67 out of a highest-possible 99 IBD Composite Rating. The Composite Rating is designed to help investors easily measure a stock's fundamental and technical characteristics.\n\nFundamentally, the company boasts a deteriorating track record of earnings growth, resulting in a 70 (out of a best-possible 99) EPS Rating. Meanwhile, the company has a solid B SMR Rating. The EPS Rating measures a company's current quarterly earnings and annual earnings growth. The SMR Rating checks under the hood at a company's sales, margins and return on equity.\n\nStarbucks Stock News: $3.2 Billion In Lost Revenue\nOn March 15, amid the spreading coronavirus outbreak, Starbucks moved into a \"to-go\" model for its stores in the U.S. and Canada for at least two weeks. Starbucks also said some of its stores in \"high-social gathering\" areas will be shuttered to help prevent the spread of the virus. The moves came in the wake of the U.S. government's call for more social distancing.\n\nOn April 16, Starbucks announced plans to reopen stores that closed during the coronavirus outbreak. In a letter to employees, CEO Kevin Johnson said, \"As we have experienced in China, we are now transitioning to a new phase that can best be described as 'monitor and adapt.\"\n\nIn late April, the company said it would start reopening U.S. stores as soon as early May, with plans to have around 90% of company-run locations open by early June with modified hours and more safety measures, but management said \"routines may look a little bit different\" even for its most loyal customers.\n\nOn May 4, the the coffee giant said it plans to reopen more than 85% of its U.S. corporate stores by end of this week. Dine-in services will remain closed for the time being.\n\nIn a letter to employees on May 21, CEO Kevin Johnson said the company has reclaimed about 60% to 65% of its U.S. same-store sales over the last week, vs. the same period a year ago.\n\nOn June 10, Starbucks said it expects to swing to a loss in its fiscal third quarter, saying it lost as much as $3.2 billion in revenue during the coronavirus outbreak. In response, Starbucks stock declined 4.1% to close at 79.01 .\n\nOn Monday, Starbucks reversed from early losses to rise 0.8% to close at 76.96 after being initiated with an overweight rating by Atlantic Equities. Meanwhile, Citigroup reduced its price target on the coffee giant from 89 to 87, while reiterating a buy rating.\n\nTop retail stock Starbucks stock triggered a long-term sell signal on Sept. 10 when it broke down below its 10-week moving average in heavy volume. On Sept. 10, restaurant stocks plunged after Wendy's (WEN) cut its full-year profit outlook, amid an expanded effort to serve breakfast nationwide in 2020.\n\nThe stock found support around that key level on two separate occasions since a Jan. 31, 2019 breakout above a 69.08 buy point in a flat base. At Starbucks' July 26 peak price of 99.72, shares of the coffee giant advanced as much as 44% past the buy point.\n\nAmid the recent stock market crash, Starbucks shares fell nearly 50% off their 52-week high. After a sharp rally, the stock is more than 20% off its old highs, and there is no current buy point. So, Starbucks is not a buy right now, but the coffee giant could always shape a new base, offering a new buy point.\n\nOn June 8, shares regained their long-term 200-day line for the first time since Feb. 21. But now the stock is back below that key level.", "created_date": "2020-07-13T06:56:51.896Z", "upvotes": 352}}, {"model": "api.stockanalysis", "pk": 12, "fields": {"author": "investmentmoats@gmail.com", "name": "Investment Moats", "title": "Here’s Why Alphabet Stock Is a Buy and Hold for the Next Decade", "ticker": "GOOGL", "text": "Advertising dollars are increasingly moving from traditional TV ads into digital. Alphabet (NASDAQ:GOOG)(NASDAQ:GOOGL) subsidiary Google, along with Facebook, are the market leaders in the digital ad space. Google's and Facebook's market power in online advertising is so large that some call the pair a duopoly.\n\nGoogle soared through the 2010s, despite facing adversities such as its legal battle with the European Commission. Its 10-year return from January 2010 to December 2019 was an astounding 405%, and Alphabet was one of the hottest tech stocks of the decade.\n\nAs Alphabet begins a new decade, it's in a strong position to continue providing excellent results to its shareholders. Here's why the company's investors will continue to earn superior returns in the next 10 years.\n\nAdvertising and other revenues are growing fast\nGoogle is the go-to place for online search, and the No. 2 search engine is far behind it. Google's search engine has a 73% market share and is known to provide the most accurate and relevant search results. Its primary source of revenue is online advertising, which also includes advertising on YouTube, and that grew over 20% in each of the last two full fiscal years.\n\nHowever, that growth has been slowing recently, with trailing-12-month (TTM) advertising revenue up just 17% compared to a year ago. Given that Google is the market leader in search, it's in an excellent position to capitalize on the shift in ad dollars moving from TV to online.\n\nAs the proliferation of low-cost mobile devices reaches the broader population in developing economies, the opportunities for Google to monetize search requests will expand. The world population is going to expand over the next decade, and most of that increase is going to come from developing countries. More people with smartphones across the globe, combined with greater availability of fast internet connections, will lead to increased revenue for the search giant.\n\nAlphabet's other revenue, which includes Google Cloud, the Google Play Store, hardware, and other products and services, is growing rapidly. According to Alphabet CFO Ruth Porat, \"Google Cloud remains one of the fastest-growing businesses in Alphabet.\" The worldwide cloud services market grew over 40% in 2019, and IDC expects cloud spending to increase at a compounded annual growth rate of 22% between now and 2023.\n\nAmazon has the largest market share in the category, but Alphabet is growing its cloud revenue at an estimated two times the rate of Amazon. Admittedly, other revenue is still a relatively small portion of overall revenue at under 20%. However, the category provides excellent growth plus diversification benefits, a one-two punch that impacts valuation positively.\n\nExcellent margins and a pristine balance sheet\nAlphabet boasts a pristine balance sheet, with $121 billion in cash and cash equivalents with only $4 billion in debt. With a balance sheet this strong, the company can afford to make investments in research and development both to maintain its lead in search and develop new products and services. It can also use its cash hoard to continue buying back shares, which will provide support to its stock price.\n\nAlphabet has been able to increase its sales and maintain excellent profit margins. Its net profit margin has held above 20% for the last three years if we exclude the one-time impact of tax changes in the U.S in 2017, while revenue also grew 20% in each of the previous two full fiscal years.\n\nIt's always a good sign to see a business can increase its sales without sacrificing its margins. This indicates that the company's products and services hold pricing power. Alphabet's proven ability to profitably grow sales is an accomplishment that's highly valued by investors.\n\nWhat this means for investors\nAlphabet is trading at a forward price-to-earnings (P/E) ratio of 25 and a PEG ratio of 1.5, which is a good value when considering all the positives. Moreover, its strong competitive position in fields that are growing fast, along with the balance sheet to make significant investments in research and development should enable it to grow revenue sustainably for the long run. Of course, there are risks to the stock: The main one is its heavy reliance on online advertising revenue. Any negative shock in that market could significantly impact its business.\n\nOverall, Alphabet's ability to grow double digits in the top and bottom line, combined with its pristine balance sheet and position in an industry that's expanding quickly, make its stock a long-term buy and hold.", "created_date": "2020-07-13T06:58:47.117Z", "upvotes": 313}}, {"model": "api.stockanalysis", "pk": 13, "fields": {"author": "investmentmoats@gmail.com", "name": "Investment Moats", "title": "Is Starbucks Stock a Buy?", "ticker": "SBUX", "text": "Starbucks (NASDAQ:SBUX) has seen its stock hit hard this year. Longtime investors may feel a sense of deja vu, as the store closures and high unemployment feel a lot like the Great Recession of 2008-2009. But the company's underlying health and infrastructure should inspire investor confidence for Starbucks' future.\n\nJust like in 2008, Starbucks is using this opportunity to close underperforming stores, refine a targeted approach, and right-size its store footprint for the future.\n\nStarbucks adapts and innovates, but change takes time\nIn the last few years, the company has influenced consumer behavior with its mobile app strategy and loyalty program. The loyalty rewards program has been hugely effective, growing to 19.4 million active U.S. members, up 15% year over year in the second quarter 2020.\n\nConsumers responded and adapted to placing pick-up orders online before the coronavirus pandemic struck, and management began plans to migrate to smaller store pick-up-only locations over the next three to five years. Pre-coronavirus takeaway comprised 80% of sales at U.S. stores. Given pandemic-driven changes to commutes and routines, Starbucks is now speeding up the increase of pick-up-only locations.\n\nWhile Starbucks has done well anticipating customers' mobile-ordering interest, COVID-19 served up some curve balls. Starbucks built a successful breakfast business, but with high unemployment and more remote working, there are a lot fewer people around first thing in the morning to drive breakfast business. Starbucks isn't alone in the breakfast slowdown; other restaurants, such as McDonald's are in the same boat.\n\nThe coffee giant has now reopened 95% of its U.S. stores. Same-store sales versus last year dropped 63% in April, improving to a 43% decline in May.\n\nChina is Starbucks second largest market and the first to be hit with COVID-19 closings. Now, 99% of stores are open, and more than 70% are back to full cafe seating. Same-store sales versus last year came in down 32% in April but improved in May to down 21%.\n\nStarbucks management believes that China's comparable store sales will substantially recover by the end of the fourth fiscal quarter, resulting in a decline of about 15% for fiscal year 2020.\n\nOn June 10 Starbucks updated guidance, saying it expects a third-quarter revenue decline of about $3.1 billion because of the pandemic. The company also guided to a per-share loss of between $0.64 to $0.79, and adjusted losses per share of $0.55 to $0.79 for the current quarter ending June 28. But it expects better results in the fourth quarter, predicting net income between $0.11 per share to $0.36 and adjusted earnings of $0.15 to $0.40 per share.\n\nStarbucks shares recently traded at $75.00, down 15% in 2020.\n\nIs now the time to invest?\nThe reported improvement is good news, but investors will have to lower expectations based on the earnings forecast issued June 10. As governments lift more restrictions on restaurants, demand should pick up. But given the spiking in the number of COVID-19 cases in parts of the U.S., we can't be sure business closures are completely off the table.\n\nStarbucks' fiscal year ends Sept. 29, so results probably wouldn't reflect any closures related to a second wave of COVID-19. Current earnings-per-share (EPS) estimates are probably already as close as possible. But getting off to a good start in fiscal 2021 is important, and that probably wouldn't happen if lockdowns begin again.\n\nStarbucks has a solid management team and a great brand, but I think investors need to see more comeback quarters after COVID-19 before buying shares. No corner of the globe has escaped the downturn, and demand going forward is still a question mark as many Starbucks consumers are still working from home or are unemployed all over the world.\n\nStarbucks has adapted to many challenges in the past, and I believe the company will weather the pandemic headwinds, but there is simply too much business uncertainty for investors to buy shares now.", "created_date": "2020-07-13T06:59:46.948Z", "upvotes": 340}}, {"model": "api.stockanalysis", "pk": 14, "fields": {"author": "investmentmoats@gmail.com", "name": "Investment Moats", "title": "Nvidia Stock Rises As Chip Giant's 'Awakening' Touted, But Is It A Buy Now?", "ticker": "NVDA", "text": "Nvidia (NVDA) stands at the forefront of artificial intelligence and machine learning, powering a future of self-driving cars, cloud gaming and data centers. Nvidia earnings for the first quarter underscored that the chipmaker's data center business is growing by leaps and bounds. So is Nvidia stock a good buy now?\n\nFor those looking for top large-cap stocks to buy now, here's a deep dive into NVDA stock.\n\nNvidia Stock Technical Analysis\nNvidia stock's IBD Composite Rating is an unbeatable 99. In other words, it's in the top 1% of all stocks based on combined technical and fundamental metrics. The IBD Stock Checkup tool can help you find other chip stocks with superior composite ratings. Investors generally should focus on stocks with CRs of 90 or even 95.\n\nShares of the chip giant have almost doubled from the March coronavirus lows. They surged 21.5% in May alone on strong Q1 results.\n\nNvidia stock is well extended from a 275.50 cup-with-handle buy point cleared in early April. Investors who bought NVDA stock at that price could consider taking some profits now, but shares are acting well.\n\nThe chip stock also is well above the 50-day line and 200-day line after undercutting them in the coronavirus stock market rout. While the major stock market indexes and many other growth stocks are now back above their 50-day lines, Nvidia stock found bullish support at this key level earlier.\n\nIn fact, NVDA stock continues to far outperform the broader market, seen in a rising relative strength line. The RS line for Nvidia stock is just below all-time highs pegged in late May, according to MarketSmith chart analysis.\n\nThe RS line, the blue line in the chart shown, tracks NVDA stock's performance vs. the S&P 500 index. It is well off the two-year low reached in early June 2019.\n\nIn May, Nvidia stock surged as Q1 earnings showed its gaming and data center businesses continue to see robust growth.\n\nNVDA stock is a well-traded stock backed by institutions: 3,149 funds owned Nvidia stock as of March. That was up from 2,901 funds in December.\n\nNvidia stock has an RS Rating of 97, meaning it has outperformed 97% of all stocks over the past year. It's a top holding in the iShares PHLX Semiconductor ETF (SOXX), along with rival AMD stock. Both Nvidia and AMD belong to the IBD 50 list of top growth stocks.\n\nNvidia Earnings And Fundamental Analysis\nThe Nvidia stock EPS Rating is a best-possible 99 and its SMR Rating is an A, on a scale of A to E, with A tops. The EPS rating reflects a company's health on fundamental earnings metrics, and its SMR Rating gauges sales growth, profit margins and return on equity.\n\nIn May, the graphics-chip maker crushed earnings estimates, earning $1.80 a share on sales of $3.08 billion. On a year-over-year basis, Nvidia earnings jumped 105% while sales climbed 39%, following a 136% EPS gain on 41% revenue growth in the prior quarter. Notably, Nvidia's data-center revenue rose 80% to $1.14 billion, helped by early Ampere shipments. This marked the first quarter in which the fast-growing business topped $1 billion in sales. Core gaming revenue rose 27% to $1.34 billion, and several analysts raised price targets on NVDA stock.\n\n\"While the shares remain expensive, there are frankly few true growth stories in semiconductors these days, and even fewer with Nvidia's current execution,\" wrote Bernstein analyst Stacy Rasgon. \"And even if expensive, we see no rationale to sell here, given product cycles on the way and a profile that continues its awakening toward a true accelerated computing company with every passing quarter.\"\n\nNvidia returned to sales and earnings growth in Q4 of fiscal 2020 after four straight down quarters. Like other chipmakers, Nvidia was hobbled by a cyclical downturn in semiconductor sales.\n\nWhen Nvidia next reports, around mid-August, analysts expect Q2 EPS to jump 57% to $1.95 as revenue grows 42% to $3.65 billion, according to Zacks Investment Research. Wall Street sees Nvidia earnings per share increasing 36% to $7.90 in all of 2021, and growing a further 22% to $9.62 in 2022.\n\nOver the past three years, Nvidia earnings per share grew by an annual 14% and sales by 10%. While that's solid enough, it's below the 25% or better a CAN SLIM investor would want to see in a top growth stock.\n\nNvidia's strong fundamental position also is reflected in a 35% annual pretax margin and 33% return on equity.\n\nThe company completed its $7 billion Mellanox acquisition on April 27, as it doubles down on data centers while positioning for leadership in AI and deep learning.\n\nIn case of broad semiconductor weakness, some experts advise investing in the highest-growth end markets of AI, self-driving cars, data centers and gaming. Nvidia taps those markets.\n\nNVDA Stock Basics\nThe fabless chipmaker pioneered graphics processing units to make video games more realistic. It's shifting to artificial intelligence chips, which have new and expanding uses in supercomputers, data centers and driverless cars.\n\nNvidia competes against AMD in chips for gaming as well as Bitcoin mining. It vies with Intel (INTC) in data-center processors, with AMD (AMD) also making a push into that market. Nvidia's data-center business counts Amazon.com (AMZN), via Amazon Web Services, as a customer.\n\nNvidia and Intel control the AI chip market, where Qualcomm (QCOM) is making inroads. Nvidia is partnering with VMware (VMW) and Amazon on an AI-driven cloud platform for big businesses.\n\nSemiconductor stocks are volatile. They rallied early this year on signs of an industry recovery and on a U.S.-China trade deal, then sold off on coronavirus fears. In 2019, the U.S. blacklisting of Huawei during the trade war weighed on many chipmakers. Huawei restrictions remain an issue for many chipmakers in 2020.\n\nChinese telecom giant Huawei relies on U.S. suppliers for its smartphones and networking devices. Both Nvidia and AMD derive 1% to 2% of revenue from Huawei. Other companies are more exposed.\n\nMeanwhile, Nvidia stock and other chip stocks are among the hardest hit from a China trade war.\n\nSemiconductor sales will rebound to 5.9% growth in 2020, research firm IHS Markit predicts. Global chip sales rose 13% in 2018 and fell an estimated 13% in 2019.\n\nThe growth of 5G wireless has stimulated demand for semiconductor products. However, the coronavirus pandemic is threatening the nascent semiconductor industry recovery. First, the deadly virus halted production in China. Then, as it spread worldwide, the pandemic caused the global economy to skid.\n\nNVDA And Rival Chip Stocks\nNVDA stock and AMD stock are established leaders in the semiconductor industry, though Nvidia has been outperforming AMD in recent weeks.\n\nNvidia's other rivals include Intel, Ambarella (AMBA), Broadcom (AVGO) and Xilinx (XLNX).\n\nAmong top chip stocks, Nvidia, AMD and data-center Inphi (IPHI) currently lead IBD's Electronics-Semiconductor Fabless industry group. Fabless chip companies, including Nvidia and Qualcomm (QCOM), contract with foundries to make the chips they design. Other chip companies own their fabrication plants.\n\nNvidia is ranked No. 3 out of roughly 30 fabless semiconductor stocks tracked by IBD. The fabless chip stocks group itself ranks No. 10 out of 197 industry groups and is showing strong price momentum.((\n\nFor the best returns, growth stock investors should focus on companies that are leading the market and their own industry group.\n\nNvidia Stock Is Not A Buy\nOn a fundamental level, Nvidia earnings and sales are rising again after sharp declines. The chip company's also strong on other key measures such as profit margins and return on equity.\n\nThe Mellanox acquisition expands Nvidia's cloud and data center opportunity.\n\nNvidia is a leader in the fabless chip group, showing strong momentum as industry headwinds ease. But some analysts suggest the coronavirus risk could chill the electronics end market through 2020.\n\nOn a technical basis, Nvidia is extended from a buy point after selling off initially on coronavirus fears. The rising RS line reflects NVDA stock's outperformance as the stock market recovers and rallies.\n\nBottom line: Nvidia stock is not a buy. But as a top-rated chip stock, it's certainly one for your investing watchlist.", "created_date": "2020-07-13T07:28:36.073Z", "upvotes": 648}}, {"model": "api.stockanalysis", "pk": 16, "fields": {"author": "thefifthperson@gmail.com", "name": "The Fifth Person", "title": "Is Advanced Micro Devices Stock a Buy?", "ticker": "AMD", "text": "Semiconductor designer Advanced Micro Devices (NASDAQ:AMD) is a big winner these days. The stock has been crushing the broader market as well as archrivals Intel (NASDAQ:INTC) and Nvidia (NASDAQ:NVDA) over the last two years:\n\nIs AMD's stock still a buy after these dramatic gains? Let's have a look.\nValuation\n\nThis is not a cheap stock. AMD's share prices are holding up fairly well in the COVID-19 health crisis, falling just 6.5% since the onset of global coronavirus worries in February. Over the same period, Intel's stock fell 11.5%, and the S&P 500 market barometer dropped 14%.\n\nEven a dramatic plunge wouldn't have made an obvious value stock out of AMD. The stock is trading at nosebleed valuation ratios: around 130 times trailing earnings and 150 times free cash flows. Buying AMD shares today amounts to a vote of confidence in CEO Lisa Su, who has made a habit out of delivering on AMD's promises. The company hasn't missed Wall Street's earnings targets since the fall of 2015, and the company's financial results tend to land exactly where analysts expected -- based on AMD's official guidance targets.\n\nAnalysts and investors see a long-term success story developing under Su's steady hand. Without that trust, AMD's stock wouldn't be valued like a high-octane growth stock.\n\nBusiness prospects\n\nCOVID-19 lockdown orders boosted the PC market in the last couple of months as office workers and students prepared to get their work done from home. Laptop sales are particularly strong right now.\n\nThat upside will shift into a downside for the next couple of quarters as the initial rush to pick up home office fixtures fades. Rising unemployment figures and uncertainty in the business world will weigh on AMD's sales instead. The most significant upside to the rest of 2020 should come in the second half of the year, as both Microsoft (NASDAQ:MSFT) and Sony (NYSE:SNE) ramp up component orders for their next-generation gaming consoles. AMD won the design bids for central processors and graphics systems in both of these surefire hit products.\n\nUnder these circumstances, AMD expects second-quarter sales to land near $1.85 billion, a 21% increase over the same period in 2019. For the full fiscal year, the company expects 25% year-over-year revenue growth and a final top-line tally of approximately $8.4 billion. Three months ago, when the coronavirus felt like a distant threat on Chinese shores, the full-year sales target stood at $8.7 billion.\n\nThe upshot: Hold your horses\n\nAMD's upswing in recent years is very convincing, and the stock may indeed have legs, but the chipmaker's shares are also priced for absolute perfection. I wouldn't bet against Lisa Su by selling AMD's stock short, but it wouldn't take much of a slip to send those skyrocketing stock prices back to earth in a hurry.\n\nIn short, AMD's stock is best watched from the sidelines until its valuation starts to make sense.", "created_date": "2020-07-13T07:34:21.281Z", "upvotes": 680}}, {"model": "api.stockanalysis", "pk": 17, "fields": {"author": "thefifthperson@gmail.com", "name": "The Fifth Person", "title": "Is It Too Late to Buy Novavax Stock?", "ticker": "NVAX", "text": "This month, the U.S. government awarded Novavax (NASDAQ:NVAX) more funding than any other company in the coronavirus vaccine race. In response, the shares surged by 32% in one trading session. Operation Warp Speed, the government's effort to help bring a vaccine to market by January, awarded the biotech company $1.6 billion. That's more than the $1.2 billion it offered to big-pharma rival AstraZeneca (NYSE:AZN) and the $483 million awarded to Moderna (NASDAQ:MRNA), the first company to bring a COVID-19 vaccine into human trials.\n\nThe move surprised the market, as Novavax wasn't on the government's list of five companies to potentially receive funding. (AstraZeneca and Moderna were.) Investors may wonder whether this new vote of confidence -- and other factors -- will lead to more share gains. Or is there little potential left in this biotech stock?\n\nIf Novavax's only advanced program were the COVID-19 vaccine, I would be very hesitant about buying the stock at this level. On optimism about COVID-19 vaccine development, the shares have risen 24-fold so far this year. That's a lot for a company that isn't yet profitable and doesn't have any products on the market.\n\nNanoFlu on the fast track\nBut what makes me optimistic about the shares for the long term is Novavax's flu vaccine. In a phase 3 clinical trial, NanoFlu met all primary endpoints. The U.S. Food and Drug Administration had already granted the vaccine fast-track status, and now the company plans to use the agency's accelerated pathway to seek approval. Novavax hasn't said when it plans to file, but with strong phase 3 data in, a regulatory submission is on the horizon.\n\nWe know there are other flu vaccines out there. As a matter of fact, nine vaccine options were available this past season. So why should we be excited about NanoFlu? One reason is its performance against a market leader. When compared with Sanofi's (NASDAQ:SNY) Fluzone, NanoFlu outperformed its rival in antibody response measures. Another reason: Analysts predict peak sales of NanoFlu may be between $550 million and $1.7 billion. And finally, the global flu vaccine market, at a 7.7% compound annual growth rate, is expected to reach $7.3 billion by 2026, according to Fortune Business Insights.\n\nStill, with attention on COVID-19 these days and the global need for a vaccine, you might wonder why I'm more focused on Novavax's flu program than on its coronavirus efforts. Here's why: COVID-19 still represents an unknown. We don't know how long the pandemic will last, how much revenue a vaccine will generate, or even how many of the players will successfully bring a product to market. We still don't know whether Novavax will even make it to the finish line. The flu market represents fewer unknowns. Novavax's NanoFlu clinical trial results make me optimistic about approval prospects -- and we can count on vaccine revenue every flu season.\n\nAnother reason to own Novavax shares\nThis doesn't mean we should shrug off the COVID-19 vaccine progress or the importance of Operation Warp Speed's investment in Novavax. Beyond NanoFlu, I see the COVID-19 vaccine candidate as an additional reason to own Novavax shares. The funding means Novavax can bring the vaccine candidate through late-stage clinical development all the way to approval and afford a large-scale manufacturing ramp-up to produce 100 million doses as early as this year.\n\nNovavax expects to report interim phase 1/2 immune response and safety data later this month. The phase 2 part of the trial will begin shortly thereafter, and Novavax aims to start phase 3, involving as many as 30,000 participants, in the fall.\n\nNow let's talk share price. In spite of recent gains, Wall Street's average estimate indicates the stock could advance 17% from here within the next 12 months. NanoFlu and the COVID-19 investigational vaccine are two major catalysts for Novavax. The former in the long term, the latter in the near term.\n\nI agree with Wall Street. Novavax shares may have further to go, even from today's level, and I like NanoFlu's long-term prospects. Still, I wouldn't recommend the stock to all investors at this point because the near term represents a good deal of risk.\n\nThe market may greatly reward -- or severely sanction -- Novavax based on COVID-19 clinical trial news in the coming months. As I always say, anything can happen during clinical trials. For that reason, only aggressive investors with risk appetite should consider buying this biotech stock right now.", "created_date": "2020-07-13T07:36:38.694Z", "upvotes": 365}}, {"model": "api.stockanalysis", "pk": 18, "fields": {"author": "thefifthperson@gmail.com", "name": "The Fifth Person", "title": "Is The Ultimate Warren Buffett Stock A Buy Amid The Coronavirus Rally?", "ticker": "BRK.A", "text": "Warren Buffett is widely regarded as one of the greatest investors of all time. One way to share in his success is to invest in his firm, Berkshire Hathaway (BRKB). Berkshire Hathaway stock is building a base, but is it a buy as stocks rally following the coronavirus crisis? Let's take a close look at the fundamental and technical performance of the ultimate Warren Buffett stock.\n\nBerkshire Hathaway is a conglomerate that owns some of America's most famous firms. It wholly owns the likes of Geico, Duracell, Dairy Queen, Fruit of the Loom and rail operator BNSF.\n\nBerkshire Hathaway Stock\nBerkshire Hathaway is perhaps more famous for serving as an investment vehicle for Warren Buffett and his top lieutenant, Charlie Munger. Following their value investing philosophy, Berkshire Hathaway owns huge stakes in American Express (AXP), Coca-Cola (KO) and other heavy hitters.\n\nBut the definition of a Warren Buffett stock has evolved in recent years. Warren Buffett became a big investor in airlines such as Delta Air Lines (DAL), but was left to rue his decision to go against his own long-held views about that industry's profitability. The move blew up in his face as airline stocks were decimated due to the global coronavirus pandemic.\n\nUnder investment managers Todd Combs and Ted Weschler, Berkshire Hathaway has been increasingly sinking money into tech, taking large positions in established giants like Apple (AAPL), as well as younger companies like Brazilian payments company StoneCo (STNE). Berkshire also snapped up a stake in Amazon.com (AMZN).\n\nWarren Buffett has also been spending more on stock buybacks. Nevertheless Berkshire slowed stock repurchases to $1.7 billion in Q1 from $2.2 billion in Q4, as he looks to protect his empire by insulating it with cash.\n\nBerkshire Hathaway Coronavirus Exposure\nAs well as its status as an investment vehicle, Berkshire Hathaway is a conglomerate in its own right. It has interests in segments such as railroads, utilities and energy. Those sectors, along with other \"real economy\" companies that are Warren Buffett staples, have been hard hit by the coronavirus shutdowns and massive economic contraction.\n\nIt has big exposure to the insurance sector by way of its ownership of Geico. States such as California are ordering insurers to give partial credits or refunds of premiums in lines such as private passenger automobile insurance, commercial automobile insurance, workers' compensation insurance and commercial liability insurance. Geico is the second largest auto insurer in the United States, after State Farm. In addition, insurance companies look set to get hit by an increase in demand for policy payouts in areas such as travel insurance, and for paying out any policies that include contagious disease coverage.\n\nBerkshire also owns BNSF Railway Company, the largest freight railroad network in North America. But profits will also be hit here due to the sudden economic contraction affecting the level of demand for its services. Union Pacific (UNP) and CSX (CSX) have already warned their businesses could see significant financial impacts.\n\nOther wholly owned businesses such as Dairy Queen, multilevel marketing company Pampered Chef, Fruit of the Loom, aviation training company FlightSafety International and real estate giant Long & Foster are also sure to be hit by the coronavirus recession.\n\nWarren Buffett's Big Gas Bill\nWarren Buffett has been criticized for the size of his cash pile. But it emerged July 6 he had finally put it to use to make his biggest acquisition in years with a $10 billion deal for Dominion Energy (D) assets.\n\nBerkshire seized the chance to secure Dominion 's gas pipeline network after the utility giant and Duke Energy (DUK) unexpectedly aborted plans to build the Atlantic Coast Pipeline.\n\nBerkshire Hathaway Energy will buy about 7,700 miles of natural gas transmission pipelines and 900 billion cubic feet of gas storage. The all-cash deal includes $4 billion of equity and $5.7 billion of debt. It's set to close in the fourth quarter.\n\n\"We are very proud to be adding such a great portfolio of natural gas assets to our already strong energy business,\" Buffett said in a statement.\n\nBerkshire Hathaway Ejects Airline Stocks\nWarren Buffett's firm revealed at its virtual annual meeting in May that it has sold off all of its airline holdings. This was part of a larger sell-off of $6.1 billion of net equities in April alone. It has sold its shares of Delta Air Lines, United Airlines (UAL), American Airlines (AAL) and Southwest Airlines (LUV). The industry is currently facing a 95% drop in air travel.\n\nBerkshire initially sold off millions of shares of Delta Air Lines and Southwest Airlines amid the coronavirus crisis, according to regulatory filings released in early April.\n\nThese initial sales made up a relatively small part of Berkshire Hathaway airline investments. It still owned around 59 million shares of Delta and 51.3 million shares of Southwest Airlines following the sales.\n\nThe sell-off came despite Warren Buffett asserting earlier in March that he had no plans to sell airline stocks. In February, Berkshire Hathaway disclosed it bought more Delta Air Lines shares.\n\nVirus Infects Warren Buffett Portfolio\nOverall, the firm's stock portfolio has taken a spanking amid the market drawback. Its biggest holdings include Apple, American Express, Bank of America (BAC) and Coca-Cola.\n\nAirlines and restaurants look sure to have long-term issues even after the economy reopens. Financials are also struggling, as a combination of what could be a historic recession and record-low interest rates send investors fleeing bank stocks.\n\nFinally, Warren Buffett made a big bet on shale just before crude oil prices crashed, taking a $10 billion stake in Occidental Petroleum (OXY) in 2019 as it outbid Chevron (CVX) for Anadarko Petroleum. With global energy demand plunging during the coronavirus crisis, shale operations are largely unprofitable now.\n\nWarren Buffett has had some winners. Apple, Amazon, drugmaker Biogen (BIIB) and consumer staples retailer Kroger (KR) are among the stocks in Berkshire Hathaway's lineup of U.S.-listed stocks that are up this year.\n\nOther Buffett Blunders\nThere have been missteps that have damaged the Berkshire Hathaway stock portfolio even before the coronavirus crisis, such as large stakes in troubled Wells Fargo (WFC) and Kraft Heinz (KHC). In fact, the firm is still carrying its Kraft investment at $13.6 billion, when its fair value is $8.1 billion, CFRA analyst Catherine Seifert said in a May 4 research note.\n\nThe Warren Buffett approach serves as a ready-built diversified portfolio for investors. But is this mix of wholly owned companies, blue chip stocks and a hand-picked selection of younger companies — along with massive insurance operations — enough to make Berkshire Hathaway stock a buy? Read on.\n\nWarren Buffett Placed These Bets\nBerkshire Hathaway's most recent 13-F filing was made late May, and it showed Buffett had shuffled his hand as he sought to take make the best of the difficult market conditions.\n\nHe snapped up shares of PNC Financial Services (PNC) and U.S. Bancorp (USB) in Q1, but tapped out of positions in Travelers (TRV) and Phillips 66 (PSX). He also reduced his Amazon stock exposure as the coronavirus took down global markets.\n\nHe also trimmed his stake in Goldman Sachs (GS) by 84%, while reducing his position in JPMorgan Chase (JPM) and Synchrony Financial (SYF) by 3% apiece, Sirius XM (SIRI) by 2%, and Teva Pharmaceutical (TEVA), VeriSign (VRSN) and DaVita Healthcare (DVA) by 1% each.\n\nMinor portfolio changes included Berkshire reducing Amazon by 0.7%, or 4,000 shares. Buffett revealed a stake in Amazon a year ago, valued at roughly $1 billion today. He also cut Biogen (BIIB) by 0.8%, or 5,425 shares\n\nOne of Berkshire's core positions is in Apple stock. He maintained his position, and it remains the No. 1 stock in Buffett's portfolio at 36.5% of assets. Stakes in the other top 10 stocks in its portfolio were unchanged.\n\nBerkshire Hathaway Stock Technical Analysis\nAmid the coronavirus-related stock market pullback, Berkshire Hathaway stock plummeted. MarketSmith analysis shows it has recovered somewhat from its woes, and is still within a consolidation pattern, technically. But it remains far from its ideal buy point of 231.71. It could also go on to potentially build a base with a lower buy point of 203.43, but this remains some ways off.\n\nBRKB stock submarined below its 50-day moving average in late February. The stock finally managed to retake the key technical benchmark on May 27, but has been struggling to hold above it after slipping back below it June 11. Berkshire stock hit resistance near its 200-day line in early June and has slumped since then.\n\nThe relative strength line of Berkshire Hathaway stock is certainly flashing warning signs for investors. It failed to stabilize after a drastic decline that started in early November. The RS line is now at its worst level since late 2007.\n\nThe RS line, the blue line in the charts, reflects Berkshire's underperformance vs. the S&P 500 index. The fact that any attempts to rally have quickly failed should offer pause for thought.\n\nMore broadly, Berkshire stock has lagged the S&P 500 index since the end of 2018. Before that, BRKB stock at best moved with the market for a decade. An investor could have bought an index fund or ETF, like the SPDR S&P 500 ETF (SPY), and generated similar returns with less stock-specific risk.\n\nBerkshire Hathaway Earnings Light\nBerkshire Hathaway earnings missed analyst estimates again in Q1. Operating EPS rose 7% to $2.41, while Wall Street had expected Berkshire earnings of $2.51. Nevertheless revenue inched up 1% to $651.3 billion. The value of its stock portfolio plunged from near the $230 billion mark, and now sits at just under $193 billion.\n\nThe miss was mainly caused by the firm seeing lower pretax income in nearly every segment. There were two bright spots however. Results for both Geico and Berkshire Hathaway Primary Group, a business unit composed of independent primary insurers, were better than expected. But even then, its operating earnings exclude around $56 billion in after-tax mark-to-market investment and derivative losses.\n\nBerkshire Cash Pile Grows, No Big Bargain Buys\nMeanwhile, the firm's cash pile has continued to grow. By the end of Q1, Berkshire's cash pile had swelled to a fresh record high of $137 billion from $128 billion at the end of Q4. Buffett previously complained that \"sky high\" prices hamstrung his hopes for an \"elephant size\" acquisition. But low prices now still aren't enough to get him off the sidelines.\n\nBuffett's sidekick Charlie Munger said he and Buffett \"just want to get through the typhoon,\" though he said the firm could still \"do something pretty aggressive or seize some opportunity.\"\n\nThe poor results have weighed on the Warren Buffett stock, causing its IBD Composite Rating to fall to just 35. Its score in this key metric has also been trending downward. This means its performance puts it among the bottom 35% of stocks tracked. The Stock Checkup Tool shows a good but not stellar Berkshire earnings-per-share growth rate of 21% over the past three years.\n\nEarnings also can be lumpy. In the last three quarters, Berkshire Hathaway earnings have actually been flat on average. This is not a good sign.\n\nWall Street is not overly optimistic for Berkshire Hathaway earnings growth, projecting it will fall 4% overall in fiscal 2020, before rebounding with a 13% rise in 2021.\n\nWith the coronavirus crisis and severe recession, it's unclear how meaningful Berkshire earnings estimates are.\n\nEarnings ultimately drive stock performance. The CAN SLIM system recommends investors look for companies with earnings and revenue growth of at least 25%.\n\nDifference Between BRKA Stock And BRKB Stock\nThe most obvious difference between Berkshire Hathaway's A class and B class shares is the price. While — at over 200 a share — BRKB stock may be considered relatively expensive, BRKA stock is the most expensive on the market at more than 300,000 a share.\n\nWarren Buffett decided to introduce the BRKB shares to allow investors to purchase stock directly. Big demand for Berkshire Hathaway stock forced less-moneyed players to plow cash into unit trusts or mutual funds that mirrored his company's holdings.\n\n\"As I have told you before, we made this sale (of BRKB shares) in response to the threatened creation of unit trusts that would have marketed themselves as Berkshire look-alikes. In the process, they would have used our past, and definitely non-repeatable, record to entice naive small investors and would have charged these innocents high fees and commissions.\"\n\nBRKB stock was split 50-for-1 in 2010. It coincided with the firm using stock to help pay for the $27 billion acquisition of railroad Burlington Northern. BRKB shares are now worth 1/1,500th of BRKA stock. However the voting rights were unchanged.\n\nBerkshire Hathaway Today\nThe modern Berkshire Hathaway operates in four main sectors.\n\nIts insurance group is one of its biggest cash cows. One of the most famous jewels in the crown is Geico, which offers private auto and property insurance. Other parts of this business include multinational property/casualty and life/health reinsurance company General Re and Berkshire Hathaway Reinsurance Group, which underwrites excess-of-loss reinsurance and quota-share coverage globally.\n\nInsurance operations are a big reason why Berkshire Hathaway earnings can be lumpy.\n\nIts Regulated Utility Business group includes Berkshire Hathaway Energy, formerly known as MidAmerican Energy. It also includes railway services arm BNSF, North America's largest freight railroad network.\n\nMeanwhile, the Manufacturing, Service & Retailing group includes Acme Building Brands, Fruit of the Loom and Justin Brands. The likes of Buffalo News, Business Wire, International Dairy Queen and NetJets fall under the service subsector. Retailers include See's Candies, Ben Bridge Jeweler, Helzberg Diamond Shops and Star Furniture.\n\nFinally, the Finance & Financial Products segment includes: Hathaway Credit Corporation, transportation equipment and furniture leasing specialists XTRA and CORT, and BH Finance whose main interest is in proprietary investing strategies.\n\nBerkshire Hathaway Stock Is Not A Buy\nBerkshire Hathaway stock has been lagging the S&P 500 index since late 2018 and especially during the coronavirus market rally. Prior to the past 18 months, BRKB stock largely moved with the market. With its broad exposure to firms that have been hit by the coronavirus recession, Berkshire Hathaway's woes may continue.\n\nAfter a late-2018 burst, Berkshire Hathaway earnings growth has been modest and uneven. Berkshire earnings declined in Q4 last year. In addition, Wall Street sees lukewarm Berkshire earnings in 2020 and 2021.\n\nWhile it may be presumptuous to bet against Warren Buffett, a canny investor looking for stocks to buy should focus on faster-growing companies, or even a broad-market ETF. The latter is an option espoused by Buffett himself, who says owning an asset such as the SPDR S&P 500 (SPY) is an ideal investment vehicle.\n\n\"In my view, for most people, the best thing to do is owning the S&P 500 index fund. If you bet on America and sustain that position for decades, you'd do far better than buying Treasury securities, or far better than following people,\" he said at Berkshire's annual meeting. \"Perhaps with a bias, I don't believe anyone knows what the market is going to do tomorrow, next week, next month, next year.\"\n\nBottom line: Berkshire Hathaway stock is not a buy.", "created_date": "2020-07-13T07:39:25.965Z", "upvotes": 321}}, {"model": "api.stockanalysis", "pk": 19, "fields": {"author": "thefifthperson@gmail.com", "name": "The Fifth Person", "title": "McDonald's Gets Faster, Leaner Amid Covid-19; Is MCD Stock A Buy?", "ticker": "MCD", "text": "McDonald's (MCD), the oldest of fast-food names and a Dow Jones stock, just delivered both good news and bad news to Wall Street. U.S. sales have recovered better than expected from the Covid-19 lockdown. But international restaurants, 10% of which remain closed, are still deep in the hole. Yet the Golden Arches looks well-positioned for the post-Covid world, when it may be leaner, faster and ready to pounce with ad dollars and innovative products at the right time. So is now a good time to add McDonald's stock to your buy list?\n\nMcDonald's Covid-19 Business Update\nIn a June 16 update, McDonald's said that global same-store sales fell 20.9% in May vs. a year earlier, after plunging 39% in April. The U.S. was a bright spot, with comparable-store sales down just 5.1% in May vs. a 19.2% fall in April.\n\nInternational sales have been slower to recover. Company-operated international restaurants saw May same-store sales fall 40.5%, with one-fourth of restaurants still closed. Among restaurants licensed by international operators, sales fell 20%, with about 15% of restaurants still closed at the end of May.\n\nJune should see international sales improve, since reopenings happened throughout May in Italy, France and Spain. In June, all U.K. restaurants are set to reopen.\n\nIn the U.S., 99% of restaurants remained open for delivery and drive-thru orders. Now more than 1,000 of about 14,000 U.S. restaurants have reopened limited seating.\n\nMcDonald's said it would boost ad spending by $200 million to revive sales, recognizing the cost in the second quarter. Early in the Covid-19 crisis, McDonald's suspended stock buybacks and raised $6.5 billion in debt markets to provide a financial cushion and support for franchisees.\n\nManagement also said it would cut capital spending by $1 billion this year, amid fewer Experience of the Future remodels and fewer new restaurants. But in the business update, McDonald's said that some franchisees want to go ahead with remodels. While a positive sign, capex won't fall as much as expected.\n\nU.S. fast-food industry restaurant traffic in May fell by roughly 15%, McDonald's said. But the average check size spiked, likely because customers brought home or ordered in meals for the whole family. Actually, lunch and dinner comparable-store sales have fully recovered. Breakfast remains weak, which management attributes to the disruption of regular commutes.\n\nMcDonald's Post-Covid\nBefore Covid-19 hit, it looked like McDonald's might be getting on a roll. The first two months of 2020 saw same-store sales grow a strong 8.1% from a year ago in the U.S. and 7.2% globally, with some help from an extra Leap Day.\n\nThe best news: The sales gains \"reflected balanced growth in average check and guest counts.\" After struggling to grow traffic, it looked like McDonald's was beginning to turn the corner.\n\nBut as the Covid threat recedes, McDonald's expects some changes to endure. The company slimmed down its menu options to maximize productivity as it closed restaurants in mid-March. CEO Chris Kempczinski said on a June 16 Evercore ISI investor call that such efforts paid off with a 25-second reduction in average drive-thru times. That followed a 20-second reduction in drive-thru times last year, which reversed part of the increase since 2016.\n\n\"We're learning what's possible and maybe conventional wisdom of how much you could really do from a capacity standpoint,\" Kempczinski said. \"I think we've learned some things about that through this crisis.\" McDonald's will eventually expand its menu from the current limited selection. But he called it \"probably unlikely\" that the menu returns to its pre-Covid size.\n\nWhen Will McDonald's Enter The Chicken Wars?\nOn Dec. 2, McDonald's said it was testing a crispy chicken sandwich through Jan. 26 in Knoxville, Tenn., and Houston. McDonald's franchisees have been asking for a chicken sandwich to help traffic trends, with Chick-fil-A gaining in popularity.\n\nDuring the Q4 earnings call on Jan. 29, Kempczinski told analysts to expect chicken segment news in 2020. \"I think we're getting close to having something that we're excited to bring to customers,\" he said.\n\nYet Kempczinski said this week, \"We've put those plans on the shelf until we had more visibility.\" Covid also sidetracked a plan for baked goods at breakfast, he said.\n\nNow, having set aside $200 million for advertising, McDonald's is considering when to jump in with chicken and ad dollars.\n\n\"The conversations are going on right now.\"\n\nMcDonald's Earnings\nFirst-quarter earnings fell 17% from a year ago amid the Covid hit in March. Even before that, McDonald's earnings saw a lull. Fourth-quarter earnings of $1.97 a share were flat from a year ago, as revenue rose 4% to $5.35 billion.\n\n\"What we're focused on is driving growth in operating margin. And our belief is that we're going to have to spend some money in order to be able to drive operating margin,\" CFO Kevin Ozan said on the Oct. 22 earnings call.\n\nMcDonald's has been investing in Experience of the Future remodels, ordering technology including kiosks, and delivery.\n\nIn March 2019, McDonald's announced the $300 million acquisition of artificial-intelligence tech company Dynamic Yield. The goal: using AI technology to optimize drive-thru menus to increase purchases, while boosting efficiency and satisfaction. Options could change based on weather, time of day and customers' prior orders. McDonald's said it has rolled out the technology to 11,000 drive-thrus in the U.S.\n\nOn Sept. 10, the Golden Arches said it was buying Apprente, a voice-recognition technology company.\n\nBTIG analyst Peter Saleh has written that the eventual deployment of Apprente's voice ordering technology could \"largely automate the ordering process, reducing labor hours and more importantly increasing throughput by speeding up the ordering process.\"\n\nThe Bull Case For MCD Stock\n\"Restaurant upgrades and technology efforts increasingly place McDonald's ahead of major competitors,\" Saleh wrote in a June 16 note, affirming a buy rating and 220 price target for MCD stock.\n\nWith much of its planned investment completed, the combination of a Covid recovery and new product launches could see a return to earnings growth.\n\nSaleh sees EPS falling 24% to $5.95 in 2020, then surging 40% to $8.35 in 2021.\n\nMCD Stock Analysis\nMCD stock went on a nice run from August 2018 to August 2019, with the stock rising about 40%. Over the same period, the S&P 500 saw single-digit gains. Fed tightening tripped up the broad stock market, then the China trade war kept investors on edge. McDonald's stock often thrives in difficult economic conditions. Investors also took a shine to the Golden Arches as it embraced fresh beef and artificial intelligence.\n\nThat run came to an end as McDonald's missed Q3 2019 earnings and same-store sales estimates and guided toward higher spending. MCD stock tumbled 5% to 199.27 on Oct. 22.\n\nWith the stock market in rally mode at the start of 2020, MCD stock made a run back toward its August 2019 high of 221.93. But it came up a bit short, cresting at 218.38 on Feb. 12. Barely a week later, the coronavirus stock market crash arrived, ushering in an unprecedented slump in economic activity.\n\nAfter falling to a three-year low on March 18, down 43% from its February peak, MCD stock has rebounded with the broad stock market, cutting its losses by nearly three-fourths.\n\nNow the Dow Jones component stands about 6% below a 202.83 buy point in a cup-with-handle base, 10 cents above its Covid-19 rally high on June 8. Since then has pulled back, though mostly on below-average volume, and sits below its 200-day moving average, evidence of lingering technical weakness.\n\nNext, look at the Golden Arches' relative strength line, which shows how MCD stock performs vs. the S&P 500 index. Despite the big rebound for McDonald's stock, its RS line, the blue line in IBD's charts, has been trending lower since March 24, the day after the Dow and S&P 500 hit bottom.\n\nThe RS line for McDonald's stock was especially strong during the severe stock market correction in late 2018. Subsequently, the RS line for MCD stock went on to hit an 8-year high in August, before losing steam. On a relative basis, MCD typically outperforms when investors get defensive, and it struggles to keep up when risk is on.\n\nHow Does McDonald's Stock Stack Up Vs. Competition?\nThe Retail-Restaurants industry group has had a pretty strong run and is now ranked No. 36 out of 197 industry groups based on price performance and momentum.\n\nIBD Stock Checkup shows that McDonald's stock isn't among the leaders in the Retail-Restaurants group. McDonald's stock has a mediocre 64 IBD Composite Rating with 99 the top rating. The Composite Rating combines several key fundamental and technical factors into a single score. IBD research shows all-time stock winners often have a Composite Rating of at least 95 near the start of big runs.\n\nMcDonald's 59 Relative Strength Rating, better than 59% of all stocks, ranks No. 26 in its industry group. By comparison, burger rival Wendy's (WEN) has a 94 RS rating, Shake Shack (SHAK) 55 and Burger King parent Restaurant Brands International (QSR) 78.\n\nAmong leading restaurant stocks, Chipotle Mexican Grill (CMG) has a 92 RS rating, Domino's Pizza (DPZ) stock has an 84 RS rating, while Wingstop (WING) stock has a 95 rating.\n\nIs McDonald's Stock A Buy?\nMcDonald's sales will likely continue to rebound, but longer-term revenue growth has been anemic in recent years.\n\nMcDonald's stock is about 6% below a proper buy point in a cup-with-handle base. In fast-food terms, it's a bit undercooked. While MCD stock could be putting together the ingredients for a run, new investors should wait for a good entry point once McDonald's exhibits strength relative to the broad stock market.\n\nBottom line: McDonald's stock is not a buy. \n\nAs long as the stock market uptrend remains intact per IBD's daily The Big Picture column, investors may find better buying opportunities in younger, faster-growing companies. To find the best stocks to buy or watch, check out IBD Stock Lists and other IBD content.", "created_date": "2020-07-13T07:41:38.219Z", "upvotes": 156}}]