[{"model": "api.stockanalysis", "pk": 1, "fields": {"author": "drwealth@gmail.com", "name": "Dr Wealth", "title": "Singapore Airlines (SIA) Rights Shares and MCBs Issues – How To Make Sense Of Them", "stock": "SIA", "text": "The Singapore Airlines (SIA) (SGX:C6L) rights issue is a complicated one and I bet most shareholders don’t know what is going on.\r\n\r\nI always believe that financial products are not shampoos and education is the only way to bridge the knowledge gap.\r\n\r\nI took the liberty to record a walkthrough of the rights issue document and highlight the salient points for SIA shareholders to take note of.\r\n\r\nSIA is offering 2 different rights issues to raise money.\r\n\r\nRights shares\r\nRights Mandatory Convertible Bonds (MCBs)\r\nRights Shares\r\nRights Shares Issue: SIA is issuing more shares to raise money. Only shareholders will receive the rights to buy more shares. The cutoff date for the shareholder list is on 5 May 2020, 5pm. Thereafter, you won’t be able to receive the rights shares even if you buy SIA shares. For every 2 shares you have, you will get 3 rights shares. You don’t need to pay for the rights. They would be automatically deposited into your CDP or custodian accounts.\r\n\r\nRenounceable rights: The rights shares are tradable on SGX. You can buy and sell them like a normal stock. If you don’t want to exercise the rights, you should sell them off. If you want to buy more shares you can also buy more rights and exercise them later. The rights shares will start trading from 13 May 2020, 9am till 21 May 2020, 5pm. The name of the rights shares will be “SIA R” with the symbol “LRDR”.\r\n\r\nIssue Price at $3: This means that you need to pay $3 per rights share in order to convert the rights into shares. The exercise deadline is on 28 May 2020, 5pm. If you hold the shares in a custodian account, your broker may set a deadline earlier than 28 May. So take note of the timing. You have to pay for the rights via ATM if you hold the rights in CDP and transfer the money to your brokerage account if the rights are held under custody.\r\n\r\nTheoretical Ex-rights Price (TERP) of S$4.40: SIA share price was around $6+ before the rights shares issue. As the new shares are issued at S$3, you can expect SIA share price to trade lower to around S$4.40 after the rights are issued. But the market may not trade according to this theoretical price.\r\n\r\nRights MCBs\r\nRights MCBs Issue: Besides the rights shares issue, SIA is also issuing rights MCBs to raise more cash. I suspect the reason for issuing MCBs is because there would be too much dilution if it is a pure rights shares issue and SIA share price will have to trade much lower. Thus to be clear, these are bonds and not shares.\r\n\r\nOnly shareholders will receive the rights to buy these bonds. The cutoff date for the shareholder list is on 5 May 2020, 5pm. Thereafter, you won’t be able to receive the rights MCBs even if you buy SIA shares. You will receive 295 rights MCBs for every 100 SIA shares you own. You don’t need to pay for the rights. They would be automatically deposited into your CDP or custodian accounts.\r\n\r\nRenounceable rights: The rights MCBs are tradable on SGX. You can buy and sell like them like a normal stock. If you don’t want to exercise the rights, you should sell them off. If you want to buy more bonds you can also buy more rights and exercise them later. The rights MCBs will start trading from 13 May 2020, 9am till 21 May 2020, 5pm. The name of the rights MCBs will be “SIA MCB R” with the symbol “GANR”.\r\n\r\nIssue Price at $1: This means that you need to pay $1 per rights MCB in order to convert the rights into bonds. The exercise deadline is on 28 May 2020, 5pm. If you hold the shares in a custodian account, your broker may set a deadline earlier than 28 May. So take note of the timing. You have to pay for the rights via ATM if you hold the rights in CDP and transfer the money to your brokerage account if the rights are held under custody.\r\n\r\nZero-coupon: The MCBs are zero-coupon bonds which means you will not receive interest payments. Instead, you will receive a maturity amount that is higher than the principal you have put in. The maturity amount is equivalent to S$1,806.11 based on $1,000 principal. Or every $1 you put in, you get $1.81 at the end of 10 years.\r\n\r\nMandatory Conversion: As the name emphasised mandatory conversion, this means that the bonds will be converted to SIA shares upon maturity. There will be no cash paid to you.\r\n\r\nCallable: The MCBs are also redeemable by SIA before maturity. They can have the option to redeem once every 6 months. Your yield will range between 4% and 6% depending on the year of redemption. The closer to the maturity, the higher the yield.\r\n\r\nSIA Rights Issues FAQ\r\nQ: How soon will I see the rights in my CDP / custodian account?\r\n\r\nNot sure. But definitely before 13 May 2020 because the rights will start trading.\r\n\r\nQ: What prices should the rights shares and rights MCBs trade at?\r\n\r\nPrice of the Rights Shares should trade close to SIA share price – $3.\r\n\r\nPrice of the Rights MCBs should trade close to $0.\r\n\r\nQ: I will have odd lots of Rights Shares and Rights MCBs, how do I sell them?\r\n\r\nThere are two more counters, SIA R1 (symbol:HTFR) and SIA MCB R1 (symbol:8YJR), where you can sell your odd lots. Ask your broker if you can amalgamate the orders for the R and R1 so that you only pay commission once.\r\n\r\nQ: If my SIA shares are held under CPFIS, must I buy the Rights & MCBs using my CPF fund? If I decided to sell the Rights, will the proceeds go back to CPF or cash?\r\n\r\nYes, you can use CPF to fund the rights purchase, provided your CPF limit allows.\r\n\r\nIf you sell the rights, the monies will go back to your CPF.\r\n\r\nQ: I have SIA shares which I have bought using cash, would I be able to exercise them with CPFIS instead of cash?\r\n\r\nNo. You have to use cash.\r\n\r\nQ: I have SIA shares in my SRS account, what do I need to do?\r\n\r\nYour agent bank which holds your shares in custody should inform you about your rights shares and MCBs. You have to follow their instructions to exercise them. Otherwise, you should sell the rights.\r\n\r\nQ: How are our shares diluted if we don’t subscribe to the rights shares?\r\n\r\nYour % ownership of SIA will reduce. Assuming you have 1m shares. And you didn’t buy more but the number of shares will increase anyway. So your % stake can drop from 0.08% to 0.03%.\r\n\r\nQ: If i do not own any SIA share can i buy the rights shares?And how do these rights shares work after I buy them?\r\n\r\nYes, you can buy the rights shares even if you do not have SIA shares. After you buy the rights shares, you still have to pay to convert the rights to shares. Don’t buy if you have no intention to exercise the rights, because the rights will expire.\r\n\r\nQ: Do we need to pay $4.84 for a MCB in order to convert it to a SIA share in 10 years’ time?\r\n\r\nNo need to pay. They will just give you the shares in exchange for the bonds.\r\n\r\nConclusion\r\nWe hope that we have simplified these rights issues to you. You have to understand this and decide what to do if you are a shareholder. Either sell the rights or exercise them. Don’t let the rights expire worthless!", "created_date": "2020-06-29T03:30:04.940Z", "upvotes": 15}}, {"model": "api.stockanalysis", "pk": 2, "fields": {"author": "drwealth@gmail.com", "name": "Dr Wealth", "title": "How SIA Shareholders Walked Away From $37 million Worth Of Free Money", "stock": "SIA", "text": "In my previous article, I have called for investors to take precautions and stay clear of both the Singapore Airlines Rights and the Mandatory Convertible Bonds (MCB) issue. There were three main thrusts to my argument.\r\n\r\nFirstly, airlines operate on notoriously bad economics and wafer thin margins. COVID19 has made the dynamics behind the airline business even worse. \r\n\r\nSecondly, the impossibly convoluted Rights and MCB issue are structured for Temasek to bail out/transfer money to SIA. There has been no attempt to explain the process and the nuances to retail investors. Investors who do not understand the risks should not to get involved. \r\n\r\nFinally, the deal ties in with our National Narrative of keeping the flag flying high and keeping the population employed. It benefits the management and staff of SIA more than the shareholders. Investors should not conflate SIA’s survival with shareholder success, or even hope to make a pretty penny out of this exercise. \r\n\r\n—————\r\n\r\nOn the 2nd of June, SIA made an announcement with regards to the outcome of the exercise. \r\n\r\nThe Rights component was over-subscribed, with 2.1 billion applications for 1.7 billion shares available. Temasek will be taking up their full allotment of 985 million new shares. All in all, more than $5 billion has been raised from just the share issue alone. \r\n\r\nBut what caught really our eye was the fact that 67 million rights shares were not taken up. They remained in the CDP account of retail investors island-wide. On the 28th May 2020 at 5pm, a silent cry went across the country as every single one of the 67 million rights expired worthless. \r\n\r\nAt the last traded price of 55 cents, the rights would have been worth $37 million. In one fell swoop, retail investors have dumped $37 million dollars in perfectly good working condition into the aircraft toilet, pressed the blue button and flushed every single one of them into oblivion. \r\n\r\n—————\r\n\r\nThe Funfair is in Town \r\nHere is what the original deal looks like. \r\n\r\nFor every 2 SIA shares in circulation, SIA will issue 3 Renounceable Rights. They are called Rights because each Right allows the holder to purchase an additional SIA share at a discounted price of $3. They are Renounceable because they can be traded on the stock exchange between 13th to 21st May. \r\n\r\nThink of these Rights as funfair tokens. Here is SIA saying to investors – Since you are our shareholder, here are some free tokens for you. We would love to see you at the funfair. The game at the fair is to buy more SIA shares at a discount. If you are not interested to play the game, by all means sell the tokens to your friends. Free Money! \r\n\r\n(It is technically not free money because by issuing shares at a discount, the current price will converge to that value and your current portfolio will take a hit. But that is a story for another day). \r\n\r\nEvery investor holding SIA shares on the 5th May has been issued with the Rights. Investors used the rights to buy more SIA shares at $3 apiece. At the end of the subscription period on the 28th May, most of the funfair tokens were used up.\r\n\r\nMost, except for 67 million of them. \r\n\r\nFor these 67 million rights, the owners neither showed up to subscribe to additional shares, nor sold them off in the open market during the trading period. At the last traded price of 55 cents, these rights are worth $37 million. \r\n\r\nHow could this have happened? Why would rational investors ever walk away from free money? Let us try to figure out how that happened. \r\n\r\nDo I even have SIA shares? \r\nAllow me to suggest yet another visualisation. Think of ourselves as gardeners. There is this little garden in our backyard. We spend our leisure time working on the garden, trimming the hedges and plucking out the weeds. We try to fill it up with the most beautiful flowers that are in season. We derive great satisfaction from seeing our flowers bloom. We become devastated when once in a decade, locusts descend on all gardens and destroy all the flowers. Few have the heart to start all over again. \r\n\r\nThis garden is our investment portfolio. The complexity increases as the size of the garden increases. Concerns about drainage, irrigation, spacing between trees, plants getting enough nutrition and enough sunlight take centrestage. When that happens, it might be better to engage a professional gardener to help tend to the grounds. \r\n\r\nBut most of us do not have that luxury. On the contrary, we look after our investment portfolios in our spare time. Investing in stocks and shares is not a full time job. We have a life beyond investing. \r\n\r\nLife happens in seasons. We finish school, begin working on our careers, start dating, get married, move house, have kids, switch jobs, tend to elderly parents.\r\n\r\nAt each period of time our focus is different. The focus consumes us. While we may say – I am going to spend 3 hours each week improving on my investment knowledge and tracking my portfolio, how many of us have the steely resolve to do so when there is a new addition to the family or in the middle of a crisis at work? \r\n\r\nAlong the way, some gardeners may decide to pick up another hobby. They may find fishing more therapeutic or cycling healthier. The time they spend in the garden gets lesser and lesser. The garden gets overgrown with weeds. In time to come, the gardener may not even remember having grown carnations before. \r\n\r\nThis could really be the case for SIA. The company was first listed on the SGX (then called the Stock Exchange of Singapore) in 1985. Over the past three and a half decade, many investors would have crossed path with the stock. Some of them could have forgotten about this flower they have planted decades ago. \r\n\r\nHow then can investors avoid facing such issues? \r\n\r\nAs with all endeavours, it is very important to know yourself. Know what you can achieve or cannot achieve. Know your strengths and weaknesses. Accept your limitations. \r\n\r\nIf you are conscientious to a fault, if you are highly disciplined and you tend to see through all your projects, you will make a better investor over your lifetime than someone who highly passionate but hops from one set of interest to another. \r\n\r\nInvesting takes time and effort. Your garden takes time to grow. For investors who tend to get distracted easily, my suggestion would be to not bother with individual stock picking. Invest in an Exchange Traded Fund instead. The STI ETF holds a basket of all the STI component stocks and is the perfect buy and hold instrument. \r\n\r\nIn gardening parlance, it is the perfect artificial green wall. You get to enjoy the soothing greenery without having to weed and water. Most important of all, you will never forget to exercise or sell your rights when the situation calls for.  \r\n\r\nA Drink called Avoidance \r\nThe early 2000s were heady days for SIA shareholders. Except for dips in 2003 and 2008, the stock price has stayed buoyant. Against the backdrop of SIA launching the world’s first commercial A380 flight, the counter rallied and hit a historical high in 2007. Till now, it has yet to find the legs to mount another challenge. \r\n\r\nImagine buying into SIA then. Your purchase price will be a tad below $20. From then on, the price has seen a slow and steady decline. \r\n\r\nEvery time the stock rebounds, you have a good mind to sell and move on. Yet every time you hang on for just that bit longer in the hope that it will recover to close the gap between your purchase price. \r\n\r\nOr perhaps your instinct tells you that Singapore Airlines being the flag carrier will never be allowed to flounder and it is a matter of time before the stock price returns to its glory days once again. \r\n\r\nAnd every time you read about how the middle eastern carriers Emirates, Etihad and Qatar Airways have grown and how aggressively they are encroaching into our markets, and about how low cost carriers are changing the industry landscape, about how SIA is no longer cost competitive, a little part of you just want to wither and die. In time to come you do not even want to read about airlines and SIA.\r\n\r\nHuman beings seek pleasure and avoid pain. Avoidance coping, according to psychologists, refer to the process of choosing your behaviour to avoid or escape particular thoughts and feelings. \r\n\r\nIf flying stresses us out, we avoid going near planes unless absolutely necessary. If throwing away our belongings brings about a sense of unease, we avoid spring cleaning and over the years allow the clutter to pile up at home. If work colleagues are unpleasant, we call in sick more often. If the task at hand is too daunting or we do not know where to begin, we avoid starting – we procrastinate. \r\n\r\nUnfortunately, these behaviour are maladaptive in nature. Over the long run, they do more harm than good. The more we procrastinate, the more overwhelming the task ahead of us appears. \r\n\r\nIn our investing journey, it is very common to have some decisions that has gone awry. Not every stock we pick will be a winner. Disciplined investors follow a framework for making their investing decisions, and they re-evaluate their decision constantly. If the original rationale for purchasing a stock no longer holds water, disciplined investors will remove the weed from the garden and sell the stock without hesitation. \r\n\r\nAn amateur investor on the other hand, might probably hold on to it hoping the price will rebound. Over the years, the garden will become overgrown with weed, and working on the garden becomes a greater chore and an unbearable pain. At that point, it becomes easier to avoid.\r\n\r\nWith a portfolio that is worth a fraction of the original investment, even logging into the trading account or picking up the phone to call your broker is a pain. \r\n\r\nIf you are reading this on the cool comfort of your couch and thinking how silly it sounds, let me assure you that the avoidance is absolutely legit. Life is tough and we find solace in our own little ways. \r\n\r\nThe Complexity of the Deal \r\nSIA was trying to achieve many things at once. The cash injection is of course crucial. If Temasek can just throw cash at the airline, it would. That would have made everyone’s lives easier. But the reality is, Temasek owns ‘only’ 56% of SIA. They have to come up with a structure that is palatable to the other shareholders as well. \r\n\r\nHad they raised the entire amount in shares alone, existing shareholders would be greatly diluted. The value of their portfolio would decrease significantly over night. On the flip side, a 100% bond offering would increase their gearing ratio and increased their cost of borrowing significantly. With neither option being perfect, they wisely took the middle road and went for a bit of each. \r\n\r\nTherein lies the problem. Our national carrier is being rescued by our Sovereign Wealth Fund. There is a rights share issue and another mandatory convertible bond issue. Many of SIA’s shareholders are mom and pop retail investors who has supported the airline over the years. The deal is complex at best and extremely convoluted at worst. Yet there was no attempt to convey the message to retail investors in plain English what the deal really is about. \r\n\r\nEven French investment bank SocGen, the issuer of a derivative called Daily Leverage Certificate (DLC) on SIA got their figures all mixed up. Traders cried foul after losing money and SocGen offered traders a ‘one-off goodwill payment’. I hope the irony is not lost on you. \r\n\r\nFinancial Literacy is the key\r\nIf you are in Paris and you cannot speak French, you will have difficulty communicating. Yes, some of the locals may understand English. Yes, you will be able to use google translate. Yes, you can even use hand gestures or draw to communicate. \r\n\r\nBut the reality is you will not be able to immense in the culture, try the most local of local cuisines, and discover the city’s more intimate secrets. The entire experience would be a radically different one. Being able to speak the language of the land is a great advantage. At the very least, it removes a lot of the stresses associated with the journey. \r\n\r\nWe live in a capitalistic society. The language of our society is money. We cannot denounce the importance of being fluent in the language. \r\n\r\nDo not get me wrong. When I say speaking the “Language of Money”, I do not mean counting every spending penny, or spending every waking minute being obsessed with making and hoarding money. \r\n\r\nRather, it is more important to understand basic monetary concepts such as compound interest, good debt vs bad debt, the importance of saving, budgeting and maintaining a healthy cash buffer against life’s contingencies. We need to pick up knowledge on how to plan our finances and protect ourselves against scams. The more savvy amongst us would do well to learn about basic accounting concepts and investing principles. \r\n\r\nNo matter which station in life you are at, this language will ensure that you are able to navigate the monetary aspects of our society with ease. We have written about the importance of financial literacy over many years. You can read the articles here here and here. \r\n\r\n37 million reasons\r\nCOVID-19 is an unprecedented event. Never have we seen airlines worldwide grounding practically their entire fleet. Never have we seen them needing to raise so much money, so fast. \r\n\r\nOn the other hand, this is definitely not the first time retail investors have left money on the table. It has happened before, and it will happen again. It could be due to a lack of information, ignorance or just plain avoidance. It is highly likely to be a combination of all these factors. \r\n\r\nPassive income is a myth and investing is hard work – anyone who is telling you otherwise is but selling you a dream. Let the SIA Rights issue be a wake-up call. \r\n\r\nIf you do not hold SIA shares, congrats and I do hope you have enjoyed the drama from the sidelines. If you have been an SIA shareholder, I thank you for doing your part for the nation. On top of that, if you have exercised sold or exercised your rights, well done. \r\n\r\nIf you have done neither, then do let this be a wake up call. If the dying cries of 37 million innocent dollars do not jolt you out of your slumber, I do not know what will.", "created_date": "2020-06-29T03:32:24.989Z", "upvotes": 18}}, {"model": "api.stockanalysis", "pk": 3, "fields": {"author": "financialhorse@gmail.com", "name": "Financial Horse", "title": "SBS Transit – Is it a good buy at the current price?", "stock": "SBS Transit", "text": "A month or two back, I wrote an article on the Top 5 Stocks / REITs on my watchlist for 2020. Of the 5 stocks, one was SBS Transit.\n\nIt generated a lot of great discussion at the time, and the ultimate conclusion reached was that SBS Transit could be a good stock – at the right price.\n\nSo in this article, I wanted to do a deeper dive into SBS Transit.\n\nBasics: What is SBS Transit\nSBS Transit makes money in 3 ways:\n\nBus Services (Basic Bus Services • Chinatown Direct Bus Services Express Bus Services • Nite Owl Bus Services City Direct Bus Services)\nRail Services (• North East Line • Downtown Line • Sengkang Light Rail Transit System Punggol Light Rail Transit System)\nOther Services (Advertising Services (those billboards you see in the MRT station and on buses) and leases of space at the station)\nAnd that’s really all there is to it.\n\nIt’s a simple, easy to understand, old school business. This is the kind of company that your textbook corporate finance and valuations work on, not those new world stuff like Facebook and Tencent.\n\nThere are a couple of nuances to SBS Transit that we need to  cover to fully understand the business\n\nBus Contracting Model\n\nThe rail service is straightforward. SBS Transit runs the North East List and Downtown Line, and it makes money from the fares paid by commuters.\n\nBuses though, operate on a Bus Contracting Model that came into force in 2016.\n\nToday has a good summary on this:\n\nUnder the model, operators bid for a package of routes through competitive tendering. The Government owns all fixed and operating assets and retains fare revenue while bus operators earn a fee for running services. \n\nBus operators also have to meet service standards set by the Land Transport Authority (LTA).\n\nThis is a departure from the previous privatised model where operating assets, such as depots and buses, were owned by both the Government and the two incumbent operators, SBS Transit (SBST) and SMRT.\n\nThe bus operators kept all the fare revenue which they used to pay for operations and operating assets.\n\nThis model, said the Government, did not incentivise operators to expand their capacity ahead of demand or improve service levels. \n\nSo the old system was like rail, where SBS Transit owns the bus, and it makes money from the fares. But this system created poor service  standards, because operators were incentivized to provide the minimum level of service to maximise profits.\n\nUnder the new Bus Contracting Model, SBS Transit will be paid a flat fee for each bus service run, with incentive fees if it meets certain standards. All the fares collected by SBS Transit will then be paid to LTA. This way, SBS Transit can focus on providing the level of standard required by LTA at the minimum cost possible to maximise profits, and consumers benefit because a certain minimum level of service is guaranteed.\n\nThe Bus Contracting Model is key, because before this, SBS Transit was generating negative free cash flow. After it came into force in 2016, everything changed, leading to the “modern era” where SBS Transit is now viewed as a cash generating monster.\n\nCommercial Sensitivities surrounding operational metrics\n\nThis was discussed at one of the AGMs:\n\nBefore opening the floor for questions at the 2019 SBS Transit AGM, Chairman Lim Jit Poh reminded shareholders not to ask questions related to the breakdown of revenue by rail or bus; the management does not disclose the details due to commercial sensitivity. SBS Transit has to bid for bus tenders under the new bus contracting model (BCM) and publishing their operating margins may give clues to how much the company could bid for their next contract. Therefore, the information is deemed to be highly sensitive. By keeping their margins confidential, this helped SBS Transit win two out of four contracts at the first open tender exercise when the BCM came into effect.\n\nSo unfortunately, we’re not able to see margin or revenue breakdown by rail or bus segments because it is commercially sensitive.\n\n60% Market Share for Bus\n\nTaken from the Fifth Person:\n\nSBS Transit has around 60% market share in Singapore from running nine out of 14 bus packages in 2018. \n\nThese made up 222 bus services with a total fleet size of 3,417 buses, an increase of 225 buses from the year before. The company employs around 6,600 bus captains to run the bus services. SMRT is the second largest bus operator in Singapore with market share of around 25%. The other two bus operators, Tower Transit and Go-Ahead (both UK-based), split the remaining market share with approximately 8% and 7% respectively. According to CEO Yang Ban Seng, market share is estimated using the total number of bus services in Singapore.\n\nShareholder\n\nThe largest shareholder is Comfort Delgro which owns about a 75% stake.\n\nFinancial Statements\nA quick look at the latest Financial Statements:\n\nIncome Statement\nQ1 Revenue (Jan to March 2020) saw a 3.3% drop in revenue, and a 44.6% drop in operating profit. This shows how tight the business is – profit margins are measured in single digits. A small drop in revenue can trigger a massive fall in profits.\n\nThis was before the circuit breaker, so Q2 is going to print a massive loss, but it will gradually recover from Q3 onwards.\n\n2019 and 2018 income statement shows that stabilized profit before taxation before COVID19 is around $95 to $99 million range. After tax is approximately $80 million.\n\nBalance Sheet + Cash Flow\n\nCurrent net gearing is a low 10.6%, and there are $250 of cash and committed bank facilities that can be tapped on.\n\nNet cash outflow in Q1 was approximately $12 million, and capex will be cut going forward to cut down on cash burn. If we assume conservatively $15 million cash burn a quarter, that still another 16 quarters worth of cash, so solvency shouldn’t be a big issue for SBS Transit.\n\nValuations and Dividend Yield\nNote: Calculations are based on share price on 29 May 2020 of $2.69\n\nValuations are really tough to run because we have no idea what earnings will look like going forward. 2020 is going to be a completely meaningless year, so we’ll just skip it entirely and look at 2021.\n\nStabilised earnings last year was $80 million, so if we assume a 20% drop in earnings to about $64 million, that gives us 13 times P/E.\n\nManagement has committed to a 50% payout ratio, so that’s a $32 million in dividend payout, works out to 10.24 cents per share, a 3.8% yield for 2021.\n\nI wanted to test if there’s any way to increase the payout ratio, and it doesn’t look so straightforward because of the capex expenditure. In 2018 and 2019, capex took up approximately $28 million a year in cashflow.\n\nIf we kept this capex, and assume the same 20% drop in earnings, that leaves around $36 million a year in cash. If management paid out 90% of that cash flow, that works out to a 32.4 million, which isn’t much more than the 32 million (based on a 50% payout ratio) we modelled above.\n\nThe crux of the issue then, is that earnings is key. If we’re going to see a 20% drop in earnings in 2021, then the company just isn’t a great investment.\n\nBut if 2021 can match 2019 in earnings, that’s $80 million profit after tax, $40 million in dividends, and a 4.75% yield, with spare cash left over.\n\nHow stable are earnings in 2021?\nSo the 2021 earnings are going to be critical to set the stage going forward.\n\nBut hand to my heart, there is absolutely no way I can think of to give an accurate estimate of 2021 earnings. Any kind of estimate will require a judgment on what the government does, and the status of COVID19 next year, which could just turn out to be completely wrong.\n\nQ1 2020 was before the circuit breaker, but it had a bit of overhang from COVID19 in China where people cut down their travel. And Q1 saw a 3.3% drop in venue and 46% drop in profits. If this holds true in 2021, that 46% drop in profit is way more aggressive than the 20% drop we’ve modelled above to get the 3.8% yield.\n\nWhichever way you look at it, there’s just going to be a lot of uncertainty about 2021’s earnings.\n\nOffline Advertising and Leasing\n\nI’m also pretty wary about the “Other Services” of Offline Advertising and Leasing of spaces at the stations. Short term, there’s just going to be big headwinds for both.\n\nLots of reports about offline ad spending migrating to online ad spend, and we all know how retail leases are going to play out this year.\n\nHow stable are earnings in the longer term?\nSo that’s the short term. Longer term, there are 2 main threats: Changes to the Bus Contracting Model, and competition from other bus operators.\n\nChanges to Bus Contracting Model\n\nToday has a good analysis on the Bus Contracting Model:\n\nOne year into the model’s implementation, operating expenditure for buses alone, which consists of the contract with the winning bus company as well as the upkeep of assets among others, was S$979 million.\n\nThe expenditure was supported by S$423 million in grants, as well as S$513 million in operating income.\n\nSince then though, the operating expenditure for buses has shot up to S$1.925 billion. Of this, government grants made up S$1.024 billion while fare revenue rose to S$834 million.\n\nThis essentially means that less than half of the operations for buses here are supported by revenues from fares, with the majority coming from Government subsidies instead.\n\nWith public transport ridership increasing at a pace of about one to two per cent each year over the last four years, fare revenue collected has not increased in tandem with operating expenditure of buses.    \n\nThis makes sense in a way.\n\nPublic transport fares are too low to maintain the current service levels if left to market forces, so the Bus Contracting Model allows LTA to “subsidize” public transport while allowing market forces to improve efficiency.\n\nIt’s a really good model, and personally, I don’t see big changes going forward. It’s a really good balance between maintaining service levels and keeping market forces in play.\n\nCompetition\n\nThere are 4 bus operators in Singapore: Tower Transit, Go-Ahead, SBS Transit and SMRT.\n\nSBS Transit holds about 60% of the market, so any gain in market share by the others will be a drop in earnings for SBS Transit.\n\nThe contracts are for 5 years each, and some are coming due in 2021, so this is another threat.\n\nThe rail business has far less competition of course, but unfortunately we don’t know the breakdown between rail and buses.\n\nPutting it all together\nSo in SBS Transit, we have an operator that runs North East Line and Downtown Line, and about 60% of the bus services in Singapore, and sells ads on all of them, and leases out some space in the stations.\n\nWe have a big question mark as to earnings over the next 1 to 2 years.\n\nWe have uncertainty over earnings in the longer term due to competition for bus contracts.\n\nAnd we also don’t have significant capital gains because most of the assets owned by SBS Transit are depreciating in nature (eg. Buses) – unlike REITs.\n\nAnd the million dollar question then – what price would SBS Transit be attractive?\n\nThe share price has already dropped about 30% from its high of $4, and there’s some longer term support at the $2.5 range.\n\nAt the $2.5 range, a 20% drop in earnings is a 4% yield, and a full recovery to 2019 earnings will work out to a 5% yield.\n\nThat’s actually not super attractive, given all the uncertainties in play. Netlink trust trades at a 5% yield now, for a lot less uncertainty. And with a blue chip REIT you can get maybe 4+% yield, but good potential for capital gains down the road.\n\nSo in a way, I don’t see SBS Transit as a compelling buy at the current price. At this price, there really isn’t a sufficient margin of safety to compensate me for the risk being taken on, especially with all the uncertainty over COVID19 recovery.\n\nBut we still have a long way to go in this crisis, and as earnings continue to fall as 2020 plays out, I wouldn’t be surprised to see SBS Transit continue to drop.\n\nAnd at some point, if it drops enough, it could become a compelling buy.\n\nI’ll give SBS Transit a 3 Horse rating at its current price. It’s a decent stock, but because of all the uncertainties in play, and short term headwinds, it’s just not an amazing buy right now. But I’ll definitely be watching this closely going forward.", "created_date": "2020-06-29T03:41:30.143Z", "upvotes": 25}}, {"model": "api.stockanalysis", "pk": 4, "fields": {"author": "financialhorse@gmail.com", "name": "Financial Horse", "title": "SingTel at S$2.96 – 3 quick thoughts on why I’m still not a buyer", "stock": "Singtel", "text": "In my previous article on SingTel, I ended off by saying that I would consider buying SingTel at a 6% dividend yield, which works out to about S$2.91. SingTel was trading at S$3.33 back then. Today, it closed at S$2.96, which is an awful lot closer to the magical 6% yield I had set for myself.\r\n\r\nI also chanced across this article shared by another blogger that puts forth quite a bullish case on SingTel.\r\n\r\nAll that got me thinking, with SingTel at S$2.96, if it were to drop a little more and start trading at a 6% yield, would I be tempted?\r\n\r\nIn my previous article, I highlighted 3 main risks with a SingTel investment: (1) Forex movement for emerging markets (2) Poor industry outlook and dynamics, (3) Competitive Singapore business.\r\n\r\nLet’s take a quick look at what’s changed since then.\r\n\r\n1. Forex Movement for Emerging Markets (EM)\r\n\r\nThis risk goes like this. SingTel holds large equity stakes in telco players in Indonesia, Phillipines, Thailand, and India. In fact, a huge portion of SingTel’s revenues are denominated in a foreign currency. With a hawkish Federal Reserve and strong US dollar, these EM currencies will come under significant pressure. A large depreciation of the local currency against the SGD will negatively impact SingTel’s earnings. It’s quite clear this risk came into play in 2018, as can be seen from SingTel’s latest earnings.\r\n\r\nBut all that’s in the past. As an investor, the only thing I’m looking at is the future, so the question here is what will EM Forex movements look like in 2019? And that’s a tricky one, because it looks a lot like the US rate hikes have caused significant stress for global financial markets, so there’s a good chance that Powell’s Federal Reserve turns more dovish in 2019. That should translate into a comparatively better year for EM Forex in 2019, which was one of the predictions I made in my Investment Predictions for 2019.\r\n\r\nHowever, while I expect 2019 to be a better year than 2018, I still think it will be a bad year for EM Forex overall. Even if there are only 2 rate hikes, it’s still a lot of pressure for these EM economies, and I just don’t see investors rushing to load up on EM risk assets just yet.\r\n\r\nVerdict: EM Forex to be less of a concern for Singtel in 2019, but it will continue to be a headwind.\r\n\r\n2. Poor Industry Outlook and Dynamics\r\nThis argument goes like this. SingTel is primarily a telco operator. They make money through consumers’ monthly phone lines. Industry trends globally have indicated that consumers are generally moving towards SIM only plans, as opposed to the traditional 24 month plans that comes with a phone. This is bad news because SIM only plans are a lower margin business, translating into lower profits.\r\n\r\nNone of this has changed. If anything, recent numbers from the industry has actually confirmed this trend.  More and more consumers have come to realise that it is cheaper to buy a phone themselves, and get a SIM only plan. I recall a research report (can’t locate the link unfortunately) which stated that the SIM only rate in Singapore is below 10%, while the rates in other developed economies are closer to 25%. That’s a lot of room to go if such reports are to be believed.\r\n\r\nIn the longer term, I continue to be worried about the long term outlook for the telco business. What is the value add of Singtel, M1 or Starhub these days? They’re a necessity to connect to the internet, but it makes absolutely no difference which one I go with. A lot of the money to be made lies further up the value chain, in the Googles, the Facebooks, the Netflixes. Unless telcos find a way to add value, they’re just going to be stuck providing commoditised services. It’s not necessarily a bad thing, but when you’re providing a commoditised service in a market where you have multiple competitors, you have no monopoly, and no pricing power, and that’s a really scary business for any investor to invest in.\r\n\r\nVerdict: The short term and long term dynamics of the industry continue to trouble me.\r\n\r\n3. Competitive Singapore Business\r\nThis last one goes like this. With TPG Telco coming in, and with TPG Telco having cheaper access to the airwaves, they’re able to price at a lower rate. This creates a price war in the local telco business, destroying margins for all existing players.\r\n\r\nSurprisingly, this was the risk that didn’t come to fruition. TPG Telco has delayed their entry into Singapore to about Q2 2019 (was originally scheduled for Q4 2018), which has translated into positive earnings results for SingTel’s Singapore business.\r\n\r\nHowever, I do expect TPG Telco to enter the Singapore market eventually, and the aggressiveness of their pricing plans will be key. If TPG Telco prices plans way below existing rates, it could be a bruising battle for all existing players.\r\n\r\nVerdict: Temporary reprieve for now, but the risk will inevitably return in 2019.\r\n\r\nClosing Thoughts\r\nThe more I think about it, the more I realise that I just don’t like SingTel as an investment because of the second risk. The industry that SingTel is operating in is frankly just horrible. There’s no monopoly, there’s no pricing power, and there’s almost no way to differentiate the product or value add. Sure, they have enterprise services where they provide specialised services to companies, and they have Digital Life where they’re trying out new products such as e-gaming, cybersecurity, mobile payments etc. But more than 50% of their revenue still comes from the traditional consumer phone business, and if that core business suffers, it’s going to take a lot of cybersecurity deals to make up for the loss in income.\r\n\r\nCoincidentally, Softbank Mobile (a Japanese telco) just IPOed today, and this blockbuster IPO tanked 15% on day one trading. Okay, some of that could be due to market sentiment and Softbank overpricing the stock, but news like these just leave me incredibly bearish on the telco industry as a whole.\r\n\r\nWith the recent correction in share prices, a lot of counters are looking very attractive now. For example, Netlink Trust is trading at about 6% yield these days, and that’s a company that’s in a true monopoly. With opportunities such as these lying around, I don’t see a need to take a risk on SingTel, especially when the outlook around its core business looks so murky.\r\n\r\nIt’s definitely worth keeping an eye on SingTel because if the market overreacts in 2019, we could well see this stock trade even lower. In such a situation, it may be worth buying a little just to trade the rebound. But as a longer term investment, I’ve come to realise that SingTel is not for me. So unfortunately, even if this does touch the magical 6% yield, I’ll be giving it a miss.\r\n\r\nTill next time, Financial Horse, signing out!", "created_date": "2020-06-29T03:43:35.973Z", "upvotes": 30}}, {"model": "api.stockanalysis", "pk": 5, "fields": {"author": "seedly@gmail.com", "name": "Seedly", "title": "Your 60-Second Guide To DBS Group Holdings Ltd (SGX: D05) Shares", "stock": "DBS", "text": "In this series, we will feature one Singapore-listed company each time as a quick guide to everything you should know about it in 60 seconds.\n\nIn this instalment, we have DBS Group Holdings Ltd (SGX: D05). Previously, we featured Ascendas Real Estate Investment Trust (SGX: A17U), an industrial REIT.\n\nWhat’s DBS Group’s Business About? \nDBS is another Singapore-listed company that doesn’t need much introduction, just like Singtel (SGX: Z74). \n\nDBS is Singapore’s largest bank and one of the biggest financial services group in Asia, with more than 280 branches across 18 markets.\n\nThe bank has four primary business segments, and they are:\n\nConsumer Banking/Wealth Management;\nInstitutional Banking;\nTreasury Markets; and\nOthers.\nIn 1998, DBS fully acquired POSB, a bank many of us would have fondly grown up with.\n\nDBS Group’s Financial Highlights \nDBS has grown its business well over the past five years, as seen from the table below:\n\nFor example, net profit (excluding one-off items) grew by a commendable 10% per annum from 2014 to 2018.\n\nMeanwhile, the bank’s net asset value (NAV) climbed 5% annually during the same time frame.\n\nNAV is the difference between a company’s assets and its liabilities. By analysing a bank’s NAV over the years, we can see how much the bank’s capital has grown. Over the long-term, a bank’s share price tends to rise in line with its capital growth.\n\nThe expansion of DBS’ return on equity from 10.9% to 12.1% shows that the bank’s management is efficient in increasing shareholder value.\n\nDBS Group’s Dividend History\nFrom 2014 to 2018, DBS’ dividend per share has surged some 20% per annum, from S$0.58 to S$1.20.\n\nIn its 2019 first-quarter earnings, DBS mentioned that its “policy of paying sustainable dividends that rise progressively with earnings remains unchanged”.\n\nSo, as long as DBS’ earnings keep up, investors can expect its dividend to grow in tandem.\n\nMajor Risk For DBS Group To Take Note Of\nIn my opinion, the rise of fintech players is a major threat for Singapore banks, including DBS.\n\nThis is especially so with Singapore’s central bank, the Monetary Authority of Singapore, issuing up to five digital bank licences next year.\n\nTo its credit, though, DBS has been innovating its services amid the digital disruption.\n\nDBS Group’s Share Price And Valuation\nDBS’ share price has risen by around 30% over the past five years to S$25.82 at the time of writing.\n\nDBS’ strong business growth, coupled with the generous dividend payouts, has certainly translated to an increasing share price.\n\nAt DBS’ current share price of S$25.82, it has a price-to-book ratio of 1.4 and a dividend yield of 4.6%.\n\nDisclaimer: The information provided by Seedly serves as an educational piece and is not intended to be personalised investment advice. ​Readers should always do their own due diligence and consider their financial goals before investing in any stock.", "created_date": "2020-06-29T03:51:54.797Z", "upvotes": 10}}, {"model": "api.stockanalysis", "pk": 6, "fields": {"author": "seedly@gmail.com", "name": "Seedly", "title": "Your 60-Second Guide To SATS Ltd (SGX: S58) Shares", "stock": "SATS", "text": "In this series, we will feature one Singapore-listed company each time as a quick guide to everything you should know about it in 60 seconds.\n\nIn this instalment, we have SATS Ltd (SGX: S58). Previously, we featured Mapletree Commercial Trust (SGX: N2IU), the owner of VivoCity and a few other properties.\n\nWhat’s SATS Ltd’s Business About? \nSATS provides food solutions and gateway services solutions, mainly to the aviation industry. \n\nThe food solutions segment provides in-flight catering and institutional catering, among other things. Meanwhile, the gateway services division offers services such as ground and cargo handling, passenger and security services, and baggage handling services. \n\nSATS Ltd’s Financial Highlights \nSATS has seen some growth from FY2014-15 to FY2018-19 (the company has a 31 March year-end):\n\nTotal revenue climbed from S$1.75 billion in FY2014-15 to S$1.83 billion in FY2018-19, translating to an annualised growth rate of just 1% over the last five years. The slow growth in its top-line signifies that SATS is a mature business.\n\nMeanwhile, its net profit grew around 6% per annum, from S$195.7 million to S$248.4 million. The increase can be mainly attributed to the growth in its associates and joint ventures and higher efficiency through technology.\n\nThe technological efficiency can be seen from SATS’ increasing net margin over the years.\n\nSATS Ltd’s Dividend History\nSATS has rewarded shareholders well in the last couple of years with growing dividends of around 8% per year.\n\nSATS said in its latest annual report that it “targets to provide sustainable dividend payouts that take into account cash flow generation and balance sheet strength, along with projected capital requirements and investments”.\n\nMajor Risk For SATS Ltd To Take Note Of\nFrom the slow top-line increase, it looks like SATS has to do more to grow its business.\n\nOn that front, SATS has earmarked S$1 billion to invest in growth initiatives over the next couple of years. The amount is huge at around four times its annual net profit. There’s an opportunity cost involved if the investments don’t pay off.\n\nSATS Ltd’s Share Price And Valuation\nFrom early 2015 to late 2019, SATS’ share price has gone up around 66% in all, which is very commendable.\n\nThe return is, of course, not including the dividends shareholders would have received over the years.\n\nAt its share price of S$5.08, SATS has a price-to-earnings (PE) ratio of 24 and a dividend yield of 3.7%.\n\nIn comparison, the SPDR STI ETF (SGX: ES3) has a PE ratio of around 12, suggesting that SATS is currently overvalued. The STI ETF can be taken as a proxy for the Straits Times Index.", "created_date": "2020-06-29T03:56:32.392Z", "upvotes": 17}}, {"model": "api.stockanalysis", "pk": 7, "fields": {"author": "thefifthperson@gmail.com", "name": "The Fifth Person", "title": "5 things I learned from the 2020 Koufu Group AGM", "stock": "Koufu", "text": "Koufu is an established Singapore household name well-known for its chain of food courts and coffee shops. Koufu Group reports two complementary business segments — Outlet and Mall Management (comprising 50 food courts, 16 coffee shops, 1 hawker centre, 1 commercial mall); and its F&B Retail segment (comprising 76 F&B stalls, 29 kiosks, 7 quick-service restaurants and 4 full-service restaurants).\n\nMost of Koufu’s outlets and stalls are in Singapore. It also operates marginally in Macau and Malaysia. Koufu leases out stalls at these outlets and operates some of the F&B stalls at these premises.\n\nKoufu was originally poised to benefit from the trade tariff-induced economic slowdown as consumers scaled down on restaurant dining. However, the lockdown in Singapore due to COVID-19 means that Koufu’s business will take quite a hit as dining out is prohibited.\n\nI tuned in to Koufu’s 2020 virtual AGM to find out how Koufu performed in FY2019 and how it intends to navigate the operational difficulties posed by COVID-19. Here are five things I learned from Koufu’s 2020 AGM.\n\n1. Koufu’s total revenue increased by 6.1% y-o-y to S$237.5 million. This was mainly due to the opening of new outlets and retail including:\n\n5 Koufu food courts (4 in Singapore, 1 in Macau)\n1 coffee shop in Singapore\n20 R&B tea outlets (18 of which are in Singapore)\n2 full-service restaurants (i.e. Elemen) in Singapore\nThe increased revenue was also due to the reopening of the food court at Marina Bay Sands, which was closed for renovation from April to July 2018.\n\nGeographically, Koufu’s revenue growth was driven mainly by revenue growth from its operations in Singapore, whose revenue increased by 6.4% y-o-y as most of Koufu’s retail and outlet expansions took place in Singapore. In FY2019, Koufu derived 92% of its revenue from its operations in Singapore.\n\nSegmentally, Koufu’s revenue growth was driven mainly by its Outlet and Mall Management segment, whose revenue increased 6.9% y-o-y. The Outlet and Mall Management segment comprised slightly more than half of Koufu’s revenue in FY2019.\n\n2. Koufu’s net profit margin increased by 0.8 percentage points to 11.7%. In comparison, Kimly, a similar F&B competitor, recorded a net profit margin of 9.6% in FY2019. However, note that neither Koufu’s net profit nor its net profit margin have exhibited a consistent upward trend over the past four financial years.\n\n3. Koufu expects both its revenue and operating profits to be negatively affected due to COVID-19. Due to lockdown measures, there is significantly lower footfall at food courts across Singapore. As per government regulations, consumers cannot dine at restaurants or food courts; they can only do takeaways or deliveries for food items. Hence, Koufu has temporarily suspended operations for 10 food courts, 3 quick-service restaurants, 2 full-service restaurants and 26 tea-beverage kiosks during the circuit breaker. However, it has since reopened 4 food courts, 3 QSRs, and 1 full-service restaurant in the current Phase 1 post-circuit breaker.\n\nKoufu’s two new food courts and two new R&B tea kiosks scheduled to open in Q2 2020 have been delayed to Q3 2020. But these plans are all subject to the COVID-19 outbreak situation stabilising or improving in Singapore.\n\n4. Koufu has plans to cope with the negative impact COVID-19 has on its business. It has partnered with delivery platforms and launched delivery services within its own ‘Koufu Eat’ app to boost its online sales. Further, it will receive government grants and rental rebates from landlords (most of which will be in Q2 and Q3 2020).\n\nKoufu also has a significant cash position to meet operational requirements for the time being. As of 31 December 2019, the company has S$90.4 million in cash and S$67.7 million in lease liabilities due in FY2020. Koufu also has S$4.7 million in borrowings.\n\n5. Koufu plans to open an integrated facility that will expand Koufu’s central kitchen by five times as well as further strengthen its procurement, food preparation, processing, and distribution functions. The facility, which is expected to be ready in Q3 2020, will also house a training centre for employees, a food court, and a R&D centre for development of F&B products and recipes.\n\nUp to 30% of total gross floor area at the facility will be rented out to Koufu’s stall holders to build their own central kitchen. The rest of the area will be for Koufu’s own business operations and joint venture businesses.\n\nKoufu has also attempted to raise productivity levels at its food courts by recognising technology as a key enabler. For example, Koufu has 43 smart tray return robots deployed to 16 food courts and coffee shops. Its mobile ordering app ‘Koufu Eat’ is also implemented at 42 food courts and coffee shops. To encourage use, customers get to enjoy a 10% discount when they order and pay through the app.", "created_date": "2020-06-29T04:00:52.528Z", "upvotes": 20}}, {"model": "api.stockanalysis", "pk": 8, "fields": {"author": "thefifthperson@gmail.com", "name": "The Fifth Person", "title": "5 things I learned from the 2020 ST Engineering AGM", "stock": "ST Engineering", "text": "Like so many stocks in the market, ST Engineering’s share price has fallen drastically due to the COVID-19 crisis. Singapore Technologies Engineering (ST Engineering) is an integrated engineering group with four key business segments in descending order of revenue contribution: Aerospace, Electronics, Land Systems and Marine.\n\nST Engineering usually derives about 30% of its revenue from customers in defence-related sectors each financial year. This is a reason why the company displays greater-than-usual financial resilience compared to a typical company. While ST Engineering recorded a strong fiscal year in 2019, management made it a point to address investors’ concerns about COVID-19’s impact on the company’s operations as well.\n\nSo here are five things I learned from ST Engineering’s 2020 AGM:\n\n1. ST Engineering recorded a strong set of financial results in 2019. It boasted 17% growth in both its revenue and profits. This increase in revenue was driven mainly by the company’s Aerospace business segment. Revenue for the Aerospace segment — which comprised 44% of the group’s revenue — increased by 30% year-on-year. This increase in revenue of the Aerospace segment was contributed largely by the newly acquired MRA Systems (MRAS). ST Engineering’s strong order book also gives it strong revenue visibility in the coming years which are expected to be economically challenging. ST’s orderbook was near its all-time high at S$15.3 billion as at the end of 2019 due to contract wins worth S$8 billion in 2019. The company’s aerospace and electronics segments also secured more than S$1.6 billion in new contracts in 1Q 2020. However, the company is held in discussions its customers to adjust delivery schedules or address order cancellations due to COVID-19.\n\n2. ST Engineering made acquisitions to strengthen its dominant positions in the Airframe MRO (maintenance, repair, and operations) and Satellite Communications (Satcom) Ground segments. In the airframe MRO segment, the company made a US$630 million acquisition of MRAS from General Electric via its U.S. subsidiary in 2019. This allows ST Engineering to scale up its aerospace capabilities in the U.S. by moving upstream into the high-value original equipment manufacturing of engine nacelle systems. (A nacelle is a housing, separate from the fuselage, that holds engines, fuel, or equipment on an aircraft.)\n\nST Engineering CEO Vincent Chong updated that the MRAS integration is progressing well and this strengthens ST’s position as a global integrated aviation solution provider. ST Engineering also established a presence in Vietnam via a MRO joint venture with Vietnam Airlines Engineering Company. This allows ST Engineering to capture the increasing demand for MRO services in Vietnam and in the APAC region.\n\n3. In the Satcom ground segment, the €250 million and US$20 million acquisitions of Newtec (now known as iDirect Europe) and Glowlink respectively in 2019 allow ST Engineering to create a highly differentiated global satcom business group. Newtec is a Belgian-based technology provider in the satellite broadcast segment with ultra-high throughput capabilities and a strong presence in the European satcom market. ST Engineering’s acquisition of Newtec allows it a strong presence in Europe. Complementing Newtec is the acquisition of Glowlink, a U.S.-based company known for its advanced satcom anti-jamming technologies that detect, geo-locate, and cancel signal interference. The combined acquisitions of Newtec and Glowlink will help ST Engineering participate in the future growth of Satcom and smart cities.\n\n4. In strengthening its Smart City track record, ST Engineering notched more project wins in the areas of smart security, smart environment, and smart mobility in 2019. The number of Smart City projects ST Engineering has undertaken now stands at over 700 across 130 cities. The impetus for the company’s venture into the Smart City space lies in the rapid urbanisation of humankind. Hence, its technological capabilities can help cities create smarter and more sustainably built environments for people to work, live and play.\n\nFor example, one of ST Engineering’s key contract wins involves providing Taiwan’s Taoyuan MRT green line with rail electronics solutions including train-borne communications, platform screen doors, automatic fare collection and supervisory control and data acquisition Systems. Below are some of ST Engineering’s notable contract wins in the area of Smart City:\n\n5. The CEO expects ST Engineering to be operationally resilient amidst COVID-19. The pandemic will affect the company in three main ways: Reduction in customer demand, supply chain disruption, and workforce disruption. The reduction in customer demand will account for ‘two-thirds’ of the negative impact the company will suffer due to COVID-19. With ongoing air travel restrictions, the aircraft maintenance requirements of airlines would naturally reduce. However, the impact will be mitigated in several ways.\n\nFirst, ST Engineering has diversified revenue streams in terms of business sectors, defence/commercial customer split, and geographies.\n\nMoreover, many of the company’s subsidiaries in Singapore and around the world have been classified as a provider of essential services. Hence, many subsidiaries continue to operate ‘substantially’ from their premises (including aerospace hangars, shipyards, automotive factories and electronics workshops) during this period. However, the disruption caused by remote working will have some impact on the company’s productivity since its worksites cannot operate at their optimal capacity. The CEO also mentioned support from various government aids and stimulus packages which were not specified.", "created_date": "2020-06-29T04:06:07.241Z", "upvotes": 7}}]