[{"model": "api.userprofile", "pk": 1, "fields": {"password": "argon2$argon2i$v=19$m=512,t=2,p=2$M2RKejFFSEZrandU$vV7Kq3oAmq2WGWEzAUUHHg", "last_login": null, "is_superuser": true, "email": "admin@gmail.com", "name": "admin", "biography": null, "linkedin": null, "profile_picture": "", "is_active": true, "is_staff": true, "total_upvotes": 0, "groups": [], "user_permissions": []}}, {"model": "api.userprofile", "pk": 2, "fields": {"password": "argon2$argon2i$v=19$m=512,t=2,p=2$V1p2N3FYUEYxeFJY$Zk4WkJavuqVfHk79NJhznA", "last_login": null, "is_superuser": false, "email": "financialhorse@gmail.com", "name": "Financial Horse", "biography": "Financial Horse was founded with a simple goal – To provide high quality financial commentary, in plain English.\r\n\r\nHe is a firm believer in Einstein’s quote that “If you can’t explain it to six-year-old, you don’t understand it yourself.” Too much of finance is shrouded in complex jargon, and Financial Horse aims to demystify financial investments.\r\n\r\nEverything on Financial Horse is based on first-hand experience, as he does not believe in recommending products that he will not invest in himself.\r\n\r\nFinancial Horse’s portfolio includes equities (US and Singapore), S-REITs, mandatory CPF contributions, and an emergency fund held via savings accounts and bonds.\r\n\r\nFinancial Horse is consistently ranked among Singapore’s top finance & investment bloggers. Regardless of whether you are a fellow blogger dropping by to say hi, a business owner looking to sponsor an article, or you just want to reach out and discuss anything at all, my door is always open!\r\n\r\nFor media & advertising enquiries (or anything at all), please contact us at admin@financialhorse.com\r\n\r\nThe content here is for informational purposes only and should NOT be taken as legal, business, tax, or investment advice. It does NOT constitute an offer or solicitation to purchase any investment or a recommendation to buy or sell a security. In fact, the content is not directed to any investor or potential investor and may not be used to evaluate or make any investment.\r\n\r\nDo note that this is not financial advice. If you are in doubt as to the action you should take, please consult your stock broker or financial advisor.", "linkedin": "https://www.linkedin.com/in/financialhorse", "profile_picture": "", "is_active": true, "is_staff": false, "total_upvotes": 120, "groups": [], "user_permissions": []}}, {"model": "api.userprofile", "pk": 3, "fields": {"password": "argon2$argon2i$v=19$m=512,t=2,p=2$QmxubTNEcjJLRzht$KRlxJjAvBEzmLj4ZuOLnaA", "last_login": null, "is_superuser": false, "email": "drwealth@gmail.com", "name": "Dr Wealth", "biography": "Dr Wealth provides trusted financial education to individuals. We teach researched and actionable investment methods so that our graduates are successful in their investment journey and achieve market-beating returns.\r\n\r\nWhat Dr Wealth Believes In\r\nInvesting is a skill set that gives returns for life.\r\nInvesting is one of the most worthwhile skill set to have because you can continue to reap returns indefinitely, regardless of your age. The younger you start, the better. Yesterday is gone, but today you can make a choice to pick up this skill. But, don't wait until tomorrow.\r\n\r\nYou come first, not sales targets.\r\nThe Monetary Authority of Singapore conducted a mystery shopping in 2011 and found that 30% of the products were clearly unsuitable. It is likely that one of every three policies you have purchased from your financial advisor is unsuitable for your situation. This is a result of having (some) advisors who prioritise sales target over the needs of their clients. We are fellow clients, so we understand. We will seek out what really works best for you because we do unto you as we want done unto us.\r\n\r\nYou don't need 'professional' or 'academic' training to be good in investing.\r\nYour investments will do well by following well-grounded, results-oriented principles. In fact, you have some advantages that a professional wouldn't have. You'd only need to understand what these advantages are to exploit them. You are investing your money, not passing exams to get a job in finance. There is a big difference.\r\n\r\nYou don't need hype.\r\nThere isn't a lack of events which make audacious claims to make you a multi-millionaire. Hype and pressure selling are common techniques employed in such events. We don't use hype. We believe investor education can be, and should be, practical and truthful.", "linkedin": "https://www.linkedin.com/in/drwealth", "profile_picture": "Dr_Wealth_Logo.png", "is_active": true, "is_staff": false, "total_upvotes": 180, "groups": [], "user_permissions": []}}, {"model": "api.userprofile", "pk": 4, "fields": {"password": "argon2$argon2i$v=19$m=512,t=2,p=2$YmlQckNONGphNFRt$uUmFDBrP9YFPrNpTIzH2Og", "last_login": null, "is_superuser": false, "email": "seedly@gmail.com", "name": "Seedly", "biography": "At Seedly, we help you make smarter financial decisions with the right tools and the right mindset\r\n\r\nLaunched in 2016, Seedly helps users make smarter financial decisions with its expense tracking app which allows users to sync their financial accounts and better manage their cash-flow.\r\n\r\nOver the years, we've introduced a community feature which allows users to crowdsource knowledge from peers before making a financial decision; an unbiased reviews platform for a myriad of products ranging from travel insurance to robo-advisors; as well as comparison tools for the open electricity market and SIM-only mobile plans.\r\n\r\nIn 2019, we also held Singapore's first personal finance festival which saw an attendance of 1,200 Singaporeans from all walks of life. \r\n\r\nAs we grow our team, we are looking for dynamic individuals to join us and make personal finance relevant and simple for the masses.\r\n\r\nWe Are Now Part Of A Larger Group\r\nAs of May 2018, we have officially joined forces with ShopBack!\r\n\r\nShopBack's raison d'être is to enable smarter decisions in the online shopping vertical.\r\n\r\nIn a way, it is in line with our vision to be a one-stop platform that helps you make smarter financial decisions with the right tools and the right mindset.", "linkedin": "https://www.linkedin.com/in/seedly", "profile_picture": "Seedly_Logo.jpg", "is_active": true, "is_staff": false, "total_upvotes": 270, "groups": [], "user_permissions": []}}, {"model": "api.userprofile", "pk": 5, "fields": {"password": "argon2$argon2i$v=19$m=512,t=2,p=2$SXZqbGdHS1ZnY2pi$xUaEqATJ7cjtawX1+dqOFQ", "last_login": null, "is_superuser": false, "email": "thefifthperson@gmail.com", "name": "The Fifth Person", "biography": "The Fifth Person believes in spreading a message — that sound investment knowledge, financial literacy, and intelligent money habits can help people around the world achieve financial independence and lead better lives for themselves and their loved ones.\r\n\r\nOur company and the knowledge we share is born of that mission.\r\n\r\nSo take a tour around our site and read the articles we have to share. There’s a lot of free and very useful content you can use right now to become a better investor. And we hope that the good stuff we have here will lead to smarter, more profitable investment decisions for you and the world at large.\r\n\r\nHelping investors make more profitable investment decisions\r\nAs investors ourselves, here are some of the winning stock investments we’ve made. (Yes, like every other investor, we’ve made our losses too). You can find our analyses for these investments  — both good and bad — on this website and through our investor memberships: The Investment Quadrant and Dividend Machines.\r\n\r\nJapan Food – 176% in three years\r\nArmstrong Industrial – 47% in two years\r\nNera Telecommunications – 32% in one year\r\nBoustead Group – 121% in four years\r\nBreadTalk – 217.3% in five years\r\nSoup Restaurant – 63% in three years\r\nARA Asset Management – 59.2% in four years\r\nLippoMall – 27% in 2.2 years\r\nSuper Group – 243% in two years\r\nYahoo – 106% in two years\r\nTracker Fund of Hong Kong – 25% in two years\r\nApple – 78% in 1.5 years\r\nNetflix – 210% in one year\r\nPremier Marketing – 74% in two years\r\nCross-Habour Holdings – 92.2% in two years\r\nMajor Cineplex – 105% in two years", "linkedin": "https://www.linkedin.com/in/thefifthperson", "profile_picture": "The_Fifth_Person_Logo.jpg", "is_active": true, "is_staff": false, "total_upvotes": 159, "groups": [], "user_permissions": []}}, {"model": "api.userprofile", "pk": 6, "fields": {"password": "argon2$argon2i$v=19$m=512,t=2,p=2$eUFDQ0pnNUdGb1d0$K4esSIFWTXXGZ8qhut8c/A", "last_login": null, "is_superuser": false, "email": "investmentmoats@gmail.com", "name": "Investment Moats", "biography": "About Investment Moats\r\nInvestment Moats is set up by Kyith Ng and have been around since 2005. He aims to share his experiences making sense of money, how money works and ways to grow his money. It hopes that by sharing his experiences, both good and bad, season investors can advice and critique his decisions and new investors can learn from them and find their own style.\r\n\r\nThis main themes discussed regularly are:\r\n\r\nGrowing and Managing Wealth. Kyith shares some of the immutable truths of wealth building, wealth spending and controlling your wealth. Kyith’s formula for building wealth is simple but you need to adjust your mindset and life to be successful in building and managing wealth. You can start off by taking a look at Kyith’s formula to building his wealth here (Kyith’s Wealthy Formula). If you are just starting your wealth building, this article on lessons learnt from Kyith’s experience is a good starter as well. (Kyith’s FI Advice)\r\nFinancial Security and Financial Independence. Kyith does not believe in the standard definition of saving for retirement. To him, it is more about building up a Wealth Machine that produce a cash flow that is able to pay for your annual basic expenses (financial security) or for your annual expenses now (financial independence). He shares why it makes more sense to achieve security and Independence than merely waiting for retirement at 65 years old and shows different, diverse ways and mindset to achieve that. You can start by taking a look at the immutable generic formula to create a Wealth Machine that produce cash flows that keeps up with inflation and covers your basic or your full expenses (Kyith’s Generic Wealth Machine Formula)\r\nMoney Management in Investing. Kyith stresses the importance of putting every single dollar to work and how it is done.\r\nIdentifying good and bad businesses. Kyith analyzes companies that he is interested in, vested in or companies that he will not touch. He discusses valuation, stability and risk as well as key economic moats that can make or break the business in the long run.\r\nDividend Income Investing. Kyith discusses the virtues of investing in dividend paying companies for growth and building a passive income. He also shows how to go about valuing REITs, MLPs, Utilities and businesses that grows their cash flow.\r\nLong Term Market Trends. Kyith takes a long term look on markets and identifies the probable direction of the market using charts and market price sentiments.\r\nTechnical Analysis. Kyith occasionally talks about companies in danger of breaking down in prices and bursting on the upside.\r\nInternational Investing and Money. Many sites are geared towards an audience that is skewed towards the United States but there are many investors who look to put their money internationally and manages their money not based in USA. Kyith discuss on how you can do that as well.\r\nKyith keeps his best articles and tools under Resources. Tune in frequently in this treasure stash to find strategies and advice that are time tested and true for most situations. [Resources here]\r\n\r\nA Little Bit About Kyith\r\nBy day, Kyith is a software and system support specialist struggling to meet user’s service level agreement, putting up with the demands of his boss and colleagues professional and sometimes personal problems.\r\n\r\nBy night, Kyith shares about his escapades in money management, investing and his love for all things technology.\r\n\r\nKyith holds a degree in Computer Science from the National University of Singapore and is certified at many levels in systems and software competency.", "linkedin": "https://www.linkedin.com/in/investmentmoats", "profile_picture": "Investment_Moats_Logo.jpg", "is_active": true, "is_staff": false, "total_upvotes": 57, "groups": [], "user_permissions": []}}]